TranNguyenDung/STM32_Xe/Program/program_00_02.c
#include "stm32h7xx_hal.h"
#include "main.h"
#include "program.h"
#include "ram.h"
#include "table.h"
//#include "flash.h"
#include "const_def.h"
#include <string.h>
/*----------------------------------------------------------------*/

/*
main program
  //init_fact();
	//dmy = 0;
	if(read_fact() == 0){
		init_fact();
		#if 0
		write_fact();
		#endif // 0
	}
	fact_bk = fact;
  //htim2.Init.Prescaler = (unsigned short)(fact.clk_Prescaler_scan[0] << 8) | fact.clk_Prescaler_scan[1];
  //htim5.Init.Prescaler = (unsigned short)(fact.clk_Prescaler_scan[0] << 8) | fact.clk_Prescaler_scan[1];
*/


//Main program
void program(void)
{
	//unsigned short i;
	//uint32_t data;
	//unsigned char tmp;
	//unsigned char dmy;
	//unsigned char *pos;
	//char data[50] = {0};
	//unsigned char buff[256];


	
	//-------------------------------
	//Read fact
	#if 0
	dmy = read_fact();
	//dmy = 0;
	if(dmy == 0){
		init_fact();
		#if 0
		write_fact();
		#endif // 0
	}
	#endif
	//-------------------------------

	
	//-------------------------------
	//timer 10ms for freqency loop code
	//Freq Tim1: 120MHz
	HAL_TIM_Base_Start_IT(&htim1);

	//With communication module IR
	HAL_UART_Receive_IT(&huart1,&r1_buff2[0],128);

	//with communication PC
	HAL_UART_Receive_IT(&huart2,&r2_buff2[0],sizeof(r2_buff2));

	//with communication bluetooth
	HAL_UART_Receive_IT(&huart3,&r3_buff2[0],128);
	
	//interrup RGB
	//HAL_TIM_Base_Start_IT(&htim2);
	//HAL_TIM_Base_Start_IT(&htim5);
	clockCouter = 6545454;//(72 * 10 ^ 6) / (htim2.Init.Prescaler + 1);
	HAL_TIM_IC_Start_IT(&htim2,TIM_CHANNEL_1);
	HAL_TIM_IC_Start_IT(&htim2,TIM_CHANNEL_2);
	HAL_TIM_IC_Start_IT(&htim2,TIM_CHANNEL_3);
	HAL_TIM_IC_Start_IT(&htim2,TIM_CHANNEL_4);
	HAL_TIM_IC_Start_IT(&htim5,TIM_CHANNEL_1);

	//HAL_TIM_Base_Start_IT(&htim3);
	//set pwm 
	//-------------------------------
	


	//-------------------------------
	#if 0//Test flash
	Flash_ProgramPage("First data written to flash",DATA_START_ADDRESS,LENGTH_START_ADDRESS);
	Flash_ReadChar(data,DATA_START_ADDRESS,LENGTH_START_ADDRESS);
	HAL_Delay(2000);
	Flash_ProgramPage("New data",DATA_START_ADDRESS,LENGTH_START_ADDRESS);
	Flash_ReadChar(data,DATA_START_ADDRESS,LENGTH_START_ADDRESS);
	#endif // 0//Test flash
	//-------------------------------
	


	//-------------------------------
#if 0
	//Reset WDT
	IWDG->KR = 0xAAAA; // Writing 0xAAAA in the Key register prevents watchdog reset
	IWDG->KR = 0xCCCC; // Start the independent watchdog timer
	//TM_WATCHDOG_Init(TM_WATCHDOG_Timeout_1s);
#endif	
	//-------------------------------
	


	//-------------------------------
#if 0//Write address module
	tmp = 37;
	Flash_Erase(ADDR_MODULE);
	Flash_Write_Int(ADDR_MODULE,tmp);
#endif

	//Read address module
	//tmp = (unsigned char) Flash_Read_Int(ADDR_MODULE);
	//addr_module = tmp;
	//-------------------------------




	//-------------------------------
#if 0//TEST FLASH
	//write 256 byte to flash
	Flash_Erase(ADDR_FACT);
	pos = &buff[0];
	for(i = 0;i < 256;i++){
		*(pos + i) = i;
	}
	Flash_Write_Page(ADDR_FACT,pos);
	pos = &buff[0];
	for(i = 0;i < 256;i++){
		*(pos + i) = 0;
	}
	Flash_Read_Page(ADDR_FACT,pos);
#endif	
	//-------------------------------
	//tmp = 0xAA;
	//save_to_flash(&tmp);
	//data = 0x0000;
	//flash_write1(&data,0x081E0000,32);


#if 0
	//PWM TEST
	HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_1);
	HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_2);
	//HAL_TIM_PWM_Stop(&htim3,TIM_CHANNEL_1);
	//HAL_TIM_PWM_Stop(&htim3,TIM_CHANNEL_2);
#endif

	init_drive();

	//GPIO_PIN_SET/GPIO_PIN_RESET = 0U,
	//HAL_GPIO_WritePin(GPIOA,PWM_ENA_Pin,GPIO_PIN_SET);
	//-------------------------------
	while(1){
		//10ms frequency
		while(htim1_flg == 0);
		htim1_flg = 0;
		//HAL_GPIO_TogglePin(TEST02_GPIO_Port,TEST02_Pin);
		HAL_IWDG_Refresh(&hiwdg1);
#if 0
		//Reset WDT
		IWDG->KR = 0xAAAA;
		//Reset Uart if error
#endif
		
		//timer_couter();
		opera();
		uart2_with_due();
		rgb_opera();
		mem_set();
		//rgb_pwm();
		//pwm_drive_opera();
		serial2_comm();
		serial3_communication();
	}
	//-------------------------------
}
/*----------------------------------------------------------------*/




/*----------------------------INIT data-------------------------------*/
//Init fact
void init_fact(void)
{
	//unsigned char i;
	unsigned long dmy;

	fact.header[0] = 0x55;
	fact.header[1] = 0xAA;
	//-------------------------
	dmy =5000;
	fact.ch1.red_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch1.red_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch1.red_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch1.red_thr[3] = (dmy & 0x000000FF) >> 0;
	fact.ch1.red_thr_chk_flg = 1;
	//-------------------------
	dmy = 5000;
	fact.ch1.green_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch1.green_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch1.green_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch1.green_thr[3] = (dmy & 0x000000FF) >> 0;
	//fact.ch1.green_thr_chk_flg = 1;
	fact.ch1.green_thr_chk_flg = 0;
	//-------------------------
	dmy = 5000;
	fact.ch1.blue_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch1.blue_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch1.blue_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch1.blue_thr[3] = (dmy & 0x000000FF) >> 0;
	//fact.ch1.blue_thr_chk_flg = 1;
	fact.ch1.blue_thr_chk_flg = 0;
	//-------------------------
	dmy = 5000;
	fact.ch1.nofiter_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch1.nofiter_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch1.nofiter_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch1.nofiter_thr[3] = (dmy & 0x000000FF) >> 0;
	//fact.ch1.nofiter_thr_chk_flg = 1;
	fact.ch1.nofiter_thr_chk_flg = 0;

	fact.ch1.thr_ok_value = 1;
	//------------------------------------------------


	//-------------------------
	dmy = 5000;
	fact.ch2.red_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch2.red_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch2.red_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch2.red_thr[3] = (dmy & 0x000000FF) >> 0;
	fact.ch2.red_thr_chk_flg = 1;
	//-------------------------
	dmy = 5000;
	fact.ch2.green_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch2.green_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch2.green_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch2.green_thr[3] = (dmy & 0x000000FF) >> 0;
	//fact.ch2.green_thr_chk_flg = 1;
	fact.ch2.green_thr_chk_flg = 0;
	//-------------------------
	dmy = 5000;
	fact.ch2.blue_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch2.blue_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch2.blue_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch2.blue_thr[3] = (dmy & 0x000000FF) >> 0;
	//fact.ch2.blue_thr_chk_flg = 1;
	fact.ch2.blue_thr_chk_flg = 0;
	//-------------------------
	dmy = 5000;
	fact.ch2.nofiter_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch2.nofiter_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch2.nofiter_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch2.nofiter_thr[3] = (dmy & 0x000000FF) >> 0;
	//fact.ch2.nofiter_thr_chk_flg = 1;
	fact.ch2.nofiter_thr_chk_flg = 0;

