TranNguyenDung/STM32_Xe/Program/program_00_02.c
	fact.ch2.thr_ok_value = 1;
	//-------------------------------------------------------
	//-------------------------
	dmy = 5000;
	fact.ch3.red_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch3.red_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch3.red_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch3.red_thr[3] = (dmy & 0x000000FF) >> 0;
	fact.ch3.red_thr_chk_flg = 1;
	//-------------------------
	dmy = 5000;
	fact.ch3.green_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch3.green_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch3.green_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch3.green_thr[3] = (dmy & 0x000000FF) >> 0;
	//fact.ch3.green_thr_chk_flg = 1;
	fact.ch3.green_thr_chk_flg = 0;
	//-------------------------
	dmy = 5000;
	fact.ch3.blue_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch3.blue_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch3.blue_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch3.blue_thr[3] = (dmy & 0x000000FF) >> 0;
	//fact.ch3.blue_thr_chk_flg = 1;
	fact.ch3.blue_thr_chk_flg = 0;
	//-------------------------
	dmy = 5000;
	fact.ch3.nofiter_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch3.nofiter_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch3.nofiter_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch3.nofiter_thr[3] = (dmy & 0x000000FF) >> 0;
	//fact.ch3.nofiter_thr_chk_flg = 1;
	fact.ch3.nofiter_thr_chk_flg = 0;

	fact.ch3.thr_ok_value = 1;
	//-----------------------------------------------------------



	//-------------------------
	dmy = 5000;
	fact.ch4.red_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch4.red_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch4.red_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch4.red_thr[3] = (dmy & 0x000000FF) >> 0;
	fact.ch4.red_thr_chk_flg = 1;
	//-------------------------
	dmy = 5000;
	fact.ch4.green_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch4.green_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch4.green_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch4.green_thr[3] = (dmy & 0x000000FF) >> 0;
	//fact.ch4.green_thr_chk_flg = 1;
	fact.ch4.green_thr_chk_flg = 0;
	//-------------------------
	dmy = 5000;
	fact.ch4.blue_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch4.blue_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch4.blue_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch4.blue_thr[3] = (dmy & 0x000000FF) >> 0;
	//fact.ch4.blue_thr_chk_flg = 1;
	fact.ch4.blue_thr_chk_flg = 0;
	//-------------------------
	dmy = 5000;
	fact.ch4.nofiter_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch4.nofiter_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch4.nofiter_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch4.nofiter_thr[3] = (dmy & 0x000000FF) >> 0;
	//fact.ch4.nofiter_thr_chk_flg = 1;
	fact.ch4.nofiter_thr_chk_flg = 0;

	fact.ch4.thr_ok_value = 1;

	//---------------------------------------------------
	dmy = 5000;
	fact.ch5.red_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch5.red_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch5.red_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch5.red_thr[3] = (dmy & 0x000000FF) >> 0;
	fact.ch5.red_thr_chk_flg = 1;
	//-------------------------
	dmy = 5000;
	fact.ch5.green_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch5.green_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch5.green_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch5.green_thr[3] = (dmy & 0x000000FF) >> 0;
	//fact.ch5.green_thr_chk_flg = 1;
	fact.ch5.green_thr_chk_flg = 0;
	//-------------------------
	dmy = 5000;
	fact.ch5.blue_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch5.blue_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch5.blue_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch5.blue_thr[3] = (dmy & 0x000000FF) >> 0;
	//fact.ch5.blue_thr_chk_flg = 1;
	fact.ch5.blue_thr_chk_flg = 0;
	//-------------------------
	dmy = 5000;
	fact.ch5.nofiter_thr[0] = (dmy & 0xFF000000) >> 24;
	fact.ch5.nofiter_thr[1] = (dmy & 0x00FF0000) >> 16;
	fact.ch5.nofiter_thr[2] = (dmy & 0x0000FF00) >> 8;
	fact.ch5.nofiter_thr[3] = (dmy & 0x000000FF) >> 0;
	//fact.ch5.nofiter_thr_chk_flg = 1;
	fact.ch5.nofiter_thr_chk_flg = 0;

	fact.ch5.thr_ok_value = 1;
	//--------------------------------------------------
	//frequency scan RGB
	dmy = 5;
	fact.clk_Prescaler_scan[0] = (dmy & 0xFF00) >> 8;
	fact.clk_Prescaler_scan[1] = (dmy & 0x00FF) >> 0;

	//Offset
	dmy = 500;
	fact.ch1.offset[0] = (dmy & 0xFF00) >> 8;
	fact.ch1.offset[1] = (dmy & 0x00FF) >> 0;

	fact.ch2.offset[0] = (dmy & 0xFF00) >> 8;
	fact.ch2.offset[1] = (dmy & 0x00FF) >> 0;

	fact.ch3.offset[0] = (dmy & 0xFF00) >> 8;
	fact.ch3.offset[1] = (dmy & 0x00FF) >> 0;

	fact.ch4.offset[0] = (dmy & 0xFF00) >> 8;
	fact.ch4.offset[1] = (dmy & 0x00FF) >> 0;

	fact.ch5.offset[0] = (dmy & 0xFF00) >> 8;
	fact.ch5.offset[1] = (dmy & 0x00FF) >> 0;

	fact.footer[0] = 0x55;
	fact.footer[1] = 0xAA;
	
	fact_bk = fact;
}

//init drive
void init_drive()
{
	
	drive.freq[0] = (htim3.Instance->ARR & 0xFF00) >> 8;
	drive.freq[1] = (htim3.Instance->ARR & 0x00FF) >> 0;
	drive.freq_bk[0] = drive.freq[0];
	drive.freq_bk[1] = drive.freq[1];

	drive.left_on = 0;
	drive.left_on_bk = 1;
	//drive.left_duty = htim3.Init.Period / 2;
	//drive.left_duty = 30;
	drive.left_duty = 18;
	//drive.left_duty_bk = htim3.Init.Period / 2;
	//drive.left_duty_bk = 30;
	drive.left_duty_bk = 18;
	drive.left_value[0] = 0;
	drive.left_value[1] = 0;

	drive.left_on1 = 0;
	drive.left_on_bk1 = 1;
	//drive.left_duty1 = htim3.Init.Period / 2;
	//drive.left_duty1 = 30;
	drive.left_duty1 = 18;
	//drive.left_duty_bk1 = htim3.Init.Period / 2;
	//drive.left_duty_bk1 = 30;
	drive.left_duty_bk1 = 18;
	drive.left_value1[0] = 0;
	drive.left_value1[1] = 0;

	drive.right_on = 0;
	drive.right_on_bk = 1;
	//drive.right_duty = htim3.Init.Period / 2;
	//drive.right_duty = 30;
	drive.right_duty = 18;
	//drive.right_duty_bk = htim3.Init.Period / 2;
	//drive.right_duty_bk = 30;
	drive.right_duty_bk = 18;
	drive.right_value[0] = 0;
	drive.right_value[1] = 0;

	drive.right_on1 = 0;
	drive.right_on_bk1 = 1;
	//drive.right_duty1 = htim3.Init.Period / 2;
	//drive.right_duty1 = 30;
	drive.right_duty1 = 18;
	//drive.right_duty_bk1 = htim3.Init.Period / 2;
	//drive.right_duty_bk1 = 30;
	drive.right_duty_bk1 = 18;
	drive.right_value1[0] = 0;
	drive.right_value1[1] = 0;

	drive.duty_set = 18;
	drive.step_duty = 1;
	drive.duty_limit = 18;

	drive_bk = drive;
}
/*----------------------------------------------------------------*/






/*----------------------------------------------------------------*/
//Couter tm run on interrupt
void timer_couter(void)
{
	if(one1sec_tm){
		one1sec_tm--;	
	}

	//TimeOut receiver module IR
	if(r1_tm > 1){
		r1_tm--;
	}
	
	//couter resend to CAR
	if(ir_scan_tm){
		ir_scan_tm--;
	}

	if(ir_run_tm){
		ir_run_tm--;
	}

