TranNguyenDung/STM32_Xe/Program/program_00_02.c
	//couter resend to due
	if(send_due_tm){
		send_due_tm--;
	}
	
	if(scan_rgb_tm){
		scan_rgb_tm--;
	}

	//re-send to Dua via IR
	if(ir_send_must_ok_tm){
		ir_send_must_ok_tm--;
	}

	if(r3_tot > 1){
		r3_tot--;
	}

	if(rgb_pwm_tot){
		rgb_pwm_tot--;
	}
}

//
void opera(void)
{
	//uint32_t data[8];
	//unsigned char tmp;
	//unsigned char i;
	//unsigned long data;
	//unsigned char tmp[256];

	if(one1sec_tm == 0){
		one1sec_tm = 100;
		//HAL_GPIO_TogglePin(LED_GPIO_Port,LED_Pin);
		//HAL_GPIO_TogglePin(LED_TEST1_GPIO_Port,LED_TEST1_Pin);
		//HAL_GPIO_TogglePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin);
		//uart2_send_string("NAME",4);
	}

	//Uart1 time out next to process
	if(r1_tm == 1){
		r1_tm = 0;
		r1_flg = 1;
	}
	
	if(r3_tot == 1){
		r3_tot = 0;
		r3_flg = 1;
	}
	
	//reset get new value
	if((fact.clk_Prescaler_scan[0] ^ fact_bk.clk_Prescaler_scan[0]) ||
		 (fact.clk_Prescaler_scan[1] ^ fact_bk.clk_Prescaler_scan[1])){
		write_fact();
		while(1);
	}

	#if 0
	//flash test
	if(flash_erase_flg){
	flash_erase_flg = 0;
		//save_to_flash(&tmp);
		erase_sector(1);
	}

	if(flash_write_flg){
		flash_write_flg = 0;
		//i = 0;
		//data[i++] = 0x01020304;
		//data[i++] = 0x05060708;
		//data[i++] = 0x090A0B0C;
		//data[i++] = 0x0D0E0F10;
		//data[i++] = 0x11121314;
		//data[i++] = 0x15161719;
		//data[i++] = 0x1A1B1C1D;
		//data[i++] = 0x1E1F2021;
		//flash_write1(&data,0x081E0000,32);
		//flash_write_v2(&data[0],0x081E0000,1);
		//flash_write_v2(&data[0],0x08100000,1);
		//flash_write_v2(&data[0],0x08120000,1);
		//fact_write_page();
	}

	if(flash_read_flg){
		flash_read_flg = 0;
		//data = Flash_Read(0x08100000 | (1 << 1) << 16);
		//read_fact();
		//flash_read(&tmp[0],0);
		__nop();
	}
	#endif // 0

}
/*----------------------------------------------------------------*/






/*----------------------------------------------------------------*/
//mem flash
void mem_set(void)
{
	if(fact_write_flg){
		if(fact_write_tm == 0){
			fact_write_flg = 0;
			write_fact();
		}
	}
	
}

//read fact data
unsigned char read_fact()
{
	struct stfact tmp;
	unsigned char flg;

	flg = 1;
	flash_read_page(&tmp.header[0],FLASH_FACT_BANK2_SECTOR);
	if(tmp.header[0] != 0x55){
		flg = 0;
	}
	else if(tmp.header[1] != 0xAA){
		flg = 0;
	}
	else if(tmp.footer[0] != 0x55){
		flg = 0;
	}
	else if(tmp.footer[1] != 0xAA){
		flg = 0;
	}
	else{
		fact = tmp;
	}

	

	return flg;
}

//write fact to flash mem
void write_fact()
{
	erase_sector(FLASH_FACT_BANK2_SECTOR);
	//flash_write(&fact.header[0],FLASH_FACT_BANK2_SECTOR);
	flash_write_page(&fact.header[0],FLASH_FACT_BANK2_SECTOR);
}

//read page 256byte
void flash_read_page(unsigned char *d_pos,unsigned char sector)
{
	//struct stfact tmp;
	unsigned long tmp[64];

	unsigned long *s_pos;
	unsigned short i,j;

	j = 0;
	s_pos = &tmp[0];
	for(i = 0;i < sizeof(tmp);i += 4){
		*(s_pos + j++) = Flash_Read((0x08100000 | (sector << 1) << 16) + i);
	}
	__nop();
	
	
	j = 0;
	for(i = 0,j=0;i < sizeof(tmp);i+=4,j++){
		*(d_pos + i + 0) = (*(s_pos + j) & 0xFF000000) >> 24;
		*(d_pos + i + 1) = (*(s_pos + j) & 0x00FF0000) >> 16;
		*(d_pos + i + 2) = (*(s_pos + j) & 0x0000FF00) >> 8;
		*(d_pos + i + 3) = (*(s_pos + j) & 0x000000FF) >> 0;
	}
	__nop();
}

//write page 256byte
void flash_write_page(unsigned char *s_pos,unsigned char sector)
{
	unsigned long addr;
	//unsigned char *s_pos;
	unsigned short i,j;
	unsigned long tmp[64];
	unsigned long *d_pos;
	//erase_sector(FLASH_FACT_BANK2_SECTOR);

	//erase_sector(sector);
	//bank2
	addr = 0x08100000 | (sector << 1) << 16;
	//s_pos = &fact.header[0];
	d_pos = &tmp[0];
	for(i = 0;i < sizeof(tmp);i+=4){
		*(d_pos + j++) = (*(s_pos + i) << 24) | (*(s_pos + i + 1) << 16) | (*(s_pos + i + 2) << 8) | (*(s_pos + i + 3));
	}

	//flash_write_v2(d_pos,FLASH_FACT_BANK2_ADDR,256);
	flash_write_v2(d_pos,addr,256);
}

//Erase sector
void erase_sector(unsigned char sector)
{
	uint32_t SectorError;
	if(sector > 7){
		return;
	}
	//HAL_FLASH_Unlock();
	HAL_FLASHEx_Unlock_Bank2();
	FLASH_EraseInitTypeDef pEraseInit;
	pEraseInit.TypeErase = FLASH_TYPEERASE_SECTORS;
	pEraseInit.Banks = FLASH_BANK_2;
	pEraseInit.Sector = sector;
	pEraseInit.NbSectors = 1;
	pEraseInit.VoltageRange = FLASH_VOLTAGE_RANGE_1;
	HAL_FLASHEx_Erase(&pEraseInit,&SectorError);
	HAL_FLASHEx_Lock_Bank2();
	//HAL_FLASH_Lock();
}

void read_flash(uint8_t *data)
{
	volatile uint32_t read_data;
	volatile uint32_t read_cnt = 0;
	do{
		//read_data = *(uint32_t *) FLASH_STORAGE;
		if(read_data != 0xFFFFFFFF){
			data[read_cnt] = (uint8_t) read_data;
			data[read_cnt + 1] = (uint8_t) (read_data >> 8);
			data[read_cnt + 2] = (uint8_t) (read_data >> 16);
			data[read_cnt + 3] = (uint8_t) (read_data >> 24);
			read_cnt += 4;
		}
	} while(read_data != 0xFFFFFFFF);
}

#define MCU_SERIES_H7
void flash_write1(const unsigned long *src,unsigned long dst,unsigned long size)
{
	// Unlock flash
	HAL_FLASH_Unlock();

	#if defined(MCU_SERIES_H7)
	// Program the flash 32 bytes at a time.
	for(int i = 0; i < size / 32; i++){
		if(HAL_FLASH_Program(FLASH_TYPEPROGRAM_FLASHWORD,dst,(uint64_t) (uint32_t) src) != HAL_OK){
			// error occurred during flash write
			HAL_FLASH_Lock(); // lock the flash
			//__fatal_error();
		}
		src += 8;
		dst += 32;
	}
	#else
	// Program the flash 4 bytes at a time.
	for(int i = 0; i < size / 4; i++){
		if(HAL_FLASH_Program(TYPEPROGRAM_WORD,dst,*src) != HAL_OK){
			// error occurred during flash write
			HAL_FLASH_Lock(); // lock the flash
			__fatal_error();
		}
		src += 1;
		dst += 4;
	}
	#endif

	// lock the flash
	HAL_FLASH_Lock();
}

//Flash write 32byte/1st
void flash_write_v2(unsigned long *src,unsigned long dst,unsigned long size)
{
	// Unlock flash
	HAL_FLASH_Unlock();
	for(int i = 0; i < size / 32; i++){//format len n*32byte
		// Program the flash 32 bytes at a time.
		if(HAL_FLASH_Program(FLASH_TYPEPROGRAM_FLASHWORD,dst,(uint64_t) (uint32_t) src) != HAL_OK){
			// error occurred during flash write
			HAL_FLASH_Lock(); // lock the flash
			//__fatal_error();
		}
		src += 8;
		dst += 32;
	}
	// lock the flash
	HAL_FLASH_Lock();
}

//read flash
unsigned long Flash_Read(unsigned long addr)
{
	unsigned long *val = (unsigned long *) addr;
	return *val;
}

/*----------------------------------------------------------------*/











/*----------------------------------------------------------------*/
//grb set PWM
void rgb_pwm()
{
	unsigned long tmp;
	unsigned long offset;
	unsigned char flg;
	//unsigned char flg2;
	unsigned char channel;

