TranNguyenDung/STM32_Xe/Program/program_00_02.c
	//------------------------------------------------------
	//When new value
	if(rgb_pwm_tot){
		//RGB mid array is RGB_CH3
		rgb_chk_ch3_flg = 1;
		flg = 1;
		if(rgb_chk_ch3_flg){
			channel = RGB_CH3;


			offset = (fact.ch3.offset[0] << 8) | fact.ch3.offset[1];

			if(fact.ch3.red_thr_chk_flg){
				tmp = (fact.ch3.red_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch3.red_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch3.red_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch3.red_thr[3] & 0xFF) << 0;

				if(rgb_ch[channel].freq_red_ct < tmp + offset){
					flg = 0;
				}
			}

			if(fact.ch3.green_thr_chk_flg){
				tmp = (fact.ch3.green_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch3.green_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch3.green_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch3.green_thr[3] & 0xFF) << 0;


				if(rgb_ch[channel].freq_green_ct < tmp + offset){
					flg = 0;
				}
			}

			if(fact.ch3.blue_thr_chk_flg){
				tmp = (fact.ch3.blue_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch3.blue_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch3.blue_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch3.blue_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_blue_ct < tmp + offset){
					flg = 0;
				}
			}

			if(fact.ch3.nofiter_thr_chk_flg){
				tmp = (fact.ch3.nofiter_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch3.nofiter_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch3.nofiter_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch3.nofiter_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_nofiter_ct < tmp + offset){
					flg = 0;
				}
			}

			if(flg){
				if(fact.ch3.thr_ok_value){
					//HAL_GPIO_WritePin(LED_TEST1_GPIO_Port,LED_TEST1_Pin,1);
				}
				else{
					//HAL_GPIO_WritePin(LED_TEST1_GPIO_Port,LED_TEST1_Pin,0);
				}
				rgb_chk_ch3_flg = 1;
			}
			else{
				//Check RGB LEFT & RIGH space level 1
				if(fact.ch3.thr_ok_value){
					//HAL_GPIO_WritePin(LED_TEST1_GPIO_Port,LED_TEST1_Pin,0);
				}
				else{
					//HAL_GPIO_WritePin(LED_TEST1_GPIO_Port,LED_TEST1_Pin,1);
				}
				rgb_chk_ch3_flg = 0;
				rgb_chk_ch2_flg = 1;
				rgb_chk_ch4_flg = 1;
			}
		}

		//-----------------------------------------------
		if(rgb_chk_ch2_flg){
			channel = RGB_CH2;
			offset = (fact.ch2.offset[0] << 8) | fact.ch2.offset[1];
			flg = 1;
			if(fact.ch2.red_thr_chk_flg){
				tmp = (fact.ch2.red_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch2.red_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch2.red_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch2.red_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_red_ct < tmp + offset){
					flg = 0;
				}
			}

			if(fact.ch2.green_thr_chk_flg){
				tmp = (fact.ch2.green_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch2.green_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch2.green_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch2.green_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_green_ct < tmp + offset){
					flg = 0;
				}
			}

			if(fact.ch2.blue_thr_chk_flg){
				tmp = (fact.ch2.blue_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch2.blue_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch2.blue_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch2.blue_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_blue_ct < tmp + offset){
					flg = 0;
				}
			}

			if(fact.ch2.nofiter_thr_chk_flg){
				tmp = (fact.ch2.nofiter_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch2.nofiter_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch2.nofiter_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch2.nofiter_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_nofiter_ct < tmp + offset){
					flg = 0;
				}
			}

			if(flg){
				if(fact.ch2.thr_ok_value){
					//HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,1);
				}
				else{
					//HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,0);
				}
				rgb_chk_ch2_flg = 1;
			}
			else{
				if(fact.ch2.thr_ok_value){
					//HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,0);
				}
				else{
					//HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,1);
				}
				rgb_chk_ch2_flg = 0;
				
			}
		}

		if(rgb_chk_ch4_flg){
			channel = RGB_CH4;
			offset = (fact.ch4.offset[0] << 8) | fact.ch4.offset[1];
			flg = 1;
			if(fact.ch4.red_thr_chk_flg){
				tmp = (fact.ch4.red_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch4.red_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch4.red_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch4.red_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_red_ct < tmp + offset){
					flg = 0;
				}
			}

			if(fact.ch4.green_thr_chk_flg){
				tmp = (fact.ch4.green_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch4.green_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch4.green_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch4.green_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_green_ct < tmp + offset){
					flg = 0;
				}
			}

			if(fact.ch4.blue_thr_chk_flg){
				tmp = (fact.ch4.blue_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch4.blue_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch4.blue_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch4.blue_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_blue_ct < tmp + offset){
					flg = 0;
				}
			}

			if(fact.ch4.nofiter_thr_chk_flg){
				tmp = (fact.ch4.nofiter_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch4.nofiter_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch4.nofiter_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch4.nofiter_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_nofiter_ct < tmp + offset){
					flg = 0;
				}
			}

			if(flg){
				if(fact.ch4.thr_ok_value){
					//HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,1);
				}
				else{
					//HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,0);
				}
				rgb_chk_ch4_flg = 1;
			}
			else{
				if(fact.ch4.thr_ok_value){
					//HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,0);
				}
				else{
					//HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,1);
				}
				rgb_chk_ch4_flg = 0;
			}
		}

		if(rgb_chk_ch4_flg || rgb_chk_ch2_flg){
			rgb_chk_ch1_flg = 0;
			rgb_chk_ch5_flg = 0;
		}
		else{
			if(rgb_chk_ch3_flg == 0){
				rgb_chk_ch1_flg = 1;
				rgb_chk_ch5_flg = 1;
			}
		}

		//-----------------------------------------------
		if(rgb_chk_ch1_flg){
			channel = RGB_CH1;
			offset = (fact.ch1.offset[0] << 8) | fact.ch1.offset[1];
			flg = 1;
			if(fact.ch1.red_thr_chk_flg){
				tmp = (fact.ch1.red_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch1.red_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch1.red_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch1.red_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_red_ct < tmp + offset){
					flg = 0;
				}
			}

