TranNguyenDung/STM32_Xe/Program/program_00_02.c
			if(fact.ch1.green_thr_chk_flg){
				tmp = (fact.ch1.green_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch1.green_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch1.green_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch1.green_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_green_ct < tmp + offset){
					flg = 0;
				}
			}

			if(fact.ch1.blue_thr_chk_flg){
				tmp = (fact.ch1.blue_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch1.blue_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch1.blue_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch1.blue_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_blue_ct < tmp + offset){
					flg = 0;
				}
			}

			if(fact.ch1.nofiter_thr_chk_flg){
				tmp = (fact.ch1.nofiter_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch1.nofiter_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch1.nofiter_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch1.nofiter_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_nofiter_ct < tmp + offset){
					flg = 0;
				}
			}

			if(flg){
				if(fact.ch1.thr_ok_value){
					//HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,1);
				}
				else{
					//HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,0);
				}
				rgb_chk_ch1_flg = 1;
			}
			else{
				if(fact.ch1.thr_ok_value){
					//HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,0);
				}
				else{
					//HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,1);
				}
				rgb_chk_ch1_flg = 0;
			}
		}

		if(rgb_chk_ch5_flg){
			channel = RGB_CH5;
			offset = (fact.ch5.offset[0] << 8) | fact.ch5.offset[1];
			flg = 1;
			if(fact.ch5.red_thr_chk_flg){
				tmp = (fact.ch5.red_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch5.red_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch5.red_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch5.red_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_red_ct < tmp + offset){
					flg = 0;
				}
			}

			if(fact.ch5.green_thr_chk_flg){
				tmp = (fact.ch5.green_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch5.green_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch5.green_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch5.green_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_green_ct < tmp + offset){
					flg = 0;
				}
			}

			if(fact.ch5.blue_thr_chk_flg){
				tmp = (fact.ch5.blue_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch5.blue_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch5.blue_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch5.blue_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_blue_ct < tmp + offset){
					flg = 0;
				}
			}

			if(fact.ch5.nofiter_thr_chk_flg){
				tmp = (fact.ch5.nofiter_thr[0] & 0xFF) << 24;
				tmp |= (fact.ch5.nofiter_thr[1] & 0xFF) << 16;
				tmp |= (fact.ch5.nofiter_thr[2] & 0xFF) << 8;
				tmp |= (fact.ch5.nofiter_thr[3] & 0xFF) << 0;
				if(rgb_ch[channel].freq_nofiter_ct < tmp + offset){
					flg = 0;
				}
			}

			if(flg){
				if(fact.ch5.thr_ok_value){
					//HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,1);
				}
				else{
					//HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,0);
				}
				rgb_chk_ch5_flg = 1;
			}
			else{
				if(fact.ch5.thr_ok_value){
					//HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,0);
				}
				else{
					//HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,1);
				}
				rgb_chk_ch5_flg = 0;
			}
		}

		//Init
		drive.left_on = 0;
		drive.left_on1 = 0;
		drive.right_on = 0;
		drive.right_on1 = 0;

		if(rgb_chk_ch3_flg){
			
			if(drive.duty_limit < drive.step_duty){
				drive.duty_limit = drive.step_duty;
			}
			
			#if 1///tien
			drive.left_on1 = 1;
			//drive.left_duty1 = 30;
			if(drive.left_duty1 < drive.duty_set){
				drive.left_duty1++;
			}
			else{
				drive.left_duty1 = drive.right_duty;
		    }
			#endif
			#if 0//lui
			drive.left_on = 1;
			//drive.left_duty1 = 30;
			if(drive.left_duty < drive.duty_set){
				drive.left_duty++;
			}
			#endif
			#if 0//lui
			drive.right_on1 = 1;
			//drive.right_duty1 = 30;
			if(drive.right_duty1 < drive.duty_set){
				drive.right_duty1++;
			}
			#endif
			#if 1//tien
			drive.right_on = 1;
			//drive.right_duty1 = 30;
			if(drive.right_duty < drive.duty_set){
				drive.right_duty++;
			}
			else{
				drive.right_duty = drive.right_duty;
			}
			#endif
		}
		else if(rgb_chk_ch2_flg){
			if(drive.duty_limit < drive.step_duty){
				drive.duty_limit = drive.step_duty;
			}
			#if 0
			drive.left_on1 = 1;
			//drive.left_duty1 = 30;
			if(drive.left_duty1 < drive.duty_set){
				drive.left_duty1++;
			}
			#endif // 0

			drive.left_on1 = 1;
			if(drive.left_duty1 > drive.duty_limit){
				drive.left_duty1 = drive.left_duty1 - drive.step_duty;
		    }
			else{
				drive.left_duty1 = drive.duty_limit;
			}
			#if 0
			drive.right_on = 1;
			if(drive.right_duty > drive.duty_limit){
				drive.right_duty = drive.right_duty - drive.step_duty;
		}
			#endif // 0
			drive.right_on = 1;
			//drive.left_duty1 = 30;
			if(drive.right_duty < drive.duty_set){
				drive.right_duty++;
			}
			else{
				drive.right_duty = drive.duty_set;
			}

		}
		else if(rgb_chk_ch4_flg){
			if(drive.duty_limit < drive.step_duty){
				drive.duty_limit = drive.step_duty;
			}
			#if 0
			drive.left_on1 = 1;
			//drive.left_duty1 = 30;
			if(drive.left_duty1 > drive.duty_limit){
				drive.left_duty1 = drive.left_duty1 - drive.step_duty;
			}
			#endif // 0
			drive.left_on1 = 1;
			//drive.left_duty1 = 30;
			if(drive.left_on1 < drive.duty_set){
				drive.left_on1++;
		}

			#if 0
			drive.right_on1 = 1;
			if(drive.right_duty1 < drive.duty_set){
				drive.right_duty1++;
			}
			#endif // 0
			drive.right_on = 1;
			//drive.left_duty1 = 30;
			if(drive.right_duty > drive.duty_limit){
				drive.right_duty = drive.right_duty - drive.step_duty;
			}
		}
		else if(rgb_chk_ch1_flg){
			if(drive.duty_limit < drive.step_duty){
				drive.duty_limit = drive.step_duty;
			}

			drive.left_on1 = 0;
			//drive.left_duty1 = 30;
			if(drive.left_duty1 > 0){
				if(drive.left_duty1 > drive.duty_limit){
					drive.left_duty1 = drive.left_duty1 - drive.step_duty;
				}
				else{
					drive.left_duty1 = 0;
				}
			}

			drive.right_on = 1;
			//drive.left_duty1 = 30;
			if(drive.right_duty < drive.duty_set){
				drive.right_duty++;
			}
			else{
				drive.right_duty = drive.duty_set;
			}

