TranNguyenDung/STM32_Xe/Program/program_00_02.c
		}
		else if(rgb_chk_ch5_flg){
			if(drive.duty_limit < drive.step_duty){
				drive.duty_limit = drive.step_duty;
			}

			drive.left_on1 = 1;
			//drive.left_duty1 = 30;
			if(drive.left_duty1 < drive.duty_set){
				drive.left_duty1++;
			}
			else{
				drive.left_duty1 = drive.duty_set;
			}

			drive.right_on1 = 0;
			//drive.left_duty1 = 30;
			if(drive.right_duty1 > 0){
				if(drive.right_duty1 > drive.duty_limit){
					drive.right_duty1 = drive.right_duty1 - drive.step_duty;
				}
				else{
					drive.right_duty1 = 0;
				}
			}

		}
		else{
			//stop speed
			//Stop PWM
			if(drive.left_on){
				drive.left_on = 0;
			}
			if(drive.left_on1){
				drive.left_on1 = 0;
			}
			if(drive.right_on){
				drive.right_on = 0;
			}
			if(drive.right_on1){
				drive.right_on1 = 0;
			}
		}
		//-----------------------------------------------
	}
	else{
		//Stop PWM
		if(drive.left_on){
			drive.left_on = 0;
		}
		if(drive.left_on1){
			drive.left_on1 = 0;
		}
		if(drive.right_on){
			drive.right_on = 0;
		}
		if(drive.right_on1){
			drive.right_on1 = 0;
		}
	}

}


//PWM drive control speed drive
void pwm_drive_opera(void)
{
	unsigned long duty;
	unsigned long tmp;
	//PWM TEST
	//HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_1);
	//HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_2);
	//HAL_TIM_PWM_Stop(&htim3,TIM_CHANNEL_1);
	//HAL_TIM_PWM_Stop(&htim3,TIM_CHANNEL_2);
	//WHEEL LEFT
	//HAL_GPIO_WritePin(GPIOA, RGB_LED_Pin|PWM_ENA_Pin, GPIO_PIN_RESET);
	if(drive.left_on){
		if(drive.left_on ^ drive.left_on_bk){
			if(drive.left_duty){
				drive.left_on_bk = drive.left_on;
				drive.left_duty_bk = drive.left_duty;
				
				if((drive.freq[0] ^ drive.freq_bk[0]) || (drive.freq[1] ^ drive.freq_bk[1])){
					drive.freq_bk[0] = drive.freq[0];
					drive.freq_bk[1] = drive.freq[1];
					tmp = drive.freq[0] << 8;
					tmp |= drive.freq[1];
					set_freq(tmp);
				}
				duty = drive.left_duty;
				set_duty(&htim3,duty,TIM_CHANNEL_1);
				HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_1);			
			}
		}
		else if(drive.left_duty ^ drive.left_duty_bk){
			drive.left_duty_bk = drive.left_duty;
			duty = drive.left_duty;
			set_duty(&htim3,duty,TIM_CHANNEL_1);
		}
		//enable PWM ENA
		if(HAL_GPIO_ReadPin(PWM_ENA_GPIO_Port,PWM_ENA_Pin) == GPIO_PIN_RESET){
			//GPIO_PIN_SET/GPIO_PIN_RESET = 0U,
			HAL_GPIO_WritePin(PWM_ENA_GPIO_Port,PWM_ENA_Pin,GPIO_PIN_SET);
		}
	}
	else{
		if(drive.left_on ^ drive.left_on_bk){
			drive.left_on_bk = drive.left_on;
			//set_duty(&htim3,drive.left_duty,TIM_CHANNEL_1);
			HAL_TIM_PWM_Stop(&htim3,TIM_CHANNEL_1);			
		}
	}


	//WHEEL LEFT1
	if(drive.left_on1){
		if(drive.left_on1 ^ drive.left_on_bk1){
			if(drive.left_duty1){
				drive.left_on_bk1 = drive.left_on1;
				drive.left_duty_bk1 = drive.left_duty1;

				if((drive.freq[0] ^ drive.freq_bk[0]) || (drive.freq[1] ^ drive.freq_bk[1])){
					drive.freq_bk[0] = drive.freq[0];
					drive.freq_bk[1] = drive.freq[1];
					tmp = drive.freq[0] << 8;
					tmp |= drive.freq[1];
					set_freq(tmp);
				}
				duty = drive.left_duty1;
				set_duty(&htim3,duty,TIM_CHANNEL_2);
				HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_2);
			}
		}
		else if(drive.left_duty1 ^ drive.left_duty_bk1){
			drive.left_duty_bk1 = drive.left_duty1;
			duty = drive.left_duty1;
			set_duty(&htim3,duty,TIM_CHANNEL_2);
		}
		//enable PWM ENA
		if(HAL_GPIO_ReadPin(PWM_ENA_GPIO_Port,PWM_ENA_Pin) == GPIO_PIN_RESET){
			//GPIO_PIN_SET/GPIO_PIN_RESET = 0U,
			HAL_GPIO_WritePin(PWM_ENA_GPIO_Port,PWM_ENA_Pin,GPIO_PIN_SET);
		}
	}
	else{
		if(drive.left_on1 ^ drive.left_on_bk1){
			drive.left_on_bk1 = drive.left_on1;
			//set_duty(&htim3,drive.left_duty,TIM_CHANNEL_1);
			HAL_TIM_PWM_Stop(&htim3,TIM_CHANNEL_2);
		}
	}

	//WHEEL RIGHT
	if(drive.right_on){
		if(drive.right_on ^ drive.right_on_bk){
			if(drive.right_duty){
				drive.right_on_bk = drive.right_on;
				drive.right_duty_bk = drive.right_duty;
				
				if((drive.freq[0] ^ drive.freq_bk[0]) || (drive.freq[1] ^ drive.freq_bk[1])){
					drive.freq_bk[0] = drive.freq[0];
					drive.freq_bk[1] = drive.freq[1];
					tmp = drive.freq[0] << 8;
					tmp |= drive.freq[1];
					set_freq(tmp);
				}
				duty = drive.right_duty;
				set_duty(&htim3,duty,TIM_CHANNEL_3);
				HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_3);			
			}
		}
		else if(drive.right_duty ^ drive.right_duty_bk){
			drive.right_duty_bk = drive.right_duty;
			duty = drive.right_duty;
			set_duty(&htim3,duty,TIM_CHANNEL_3);
		}
		//enable PWM ENA
		if(HAL_GPIO_ReadPin(PWM_ENA_GPIO_Port,PWM_ENA_Pin) == GPIO_PIN_RESET){
			//GPIO_PIN_SET/GPIO_PIN_RESET = 0U,
			HAL_GPIO_WritePin(PWM_ENA_GPIO_Port,PWM_ENA_Pin,GPIO_PIN_SET);
		}
	}
	else{
		if(drive.right_on ^ drive.right_on_bk){
			drive.right_on_bk = drive.right_on;
			//set_duty(&htim3,drive.right_duty,TIM_CHANNEL_2);
			HAL_TIM_PWM_Stop(&htim3,TIM_CHANNEL_3);			
		}
	}


	//WHEEL RIGHT
	if(drive.right_on1){
		if(drive.right_on1 ^ drive.right_on_bk1){
			if(drive.right_duty1){
				drive.right_on_bk1 = drive.right_on1;
				drive.right_duty_bk1 = drive.right_duty1;

				if((drive.freq[0] ^ drive.freq_bk[0]) || (drive.freq[1] ^ drive.freq_bk[1])){
					drive.freq_bk[0] = drive.freq[0];
					drive.freq_bk[1] = drive.freq[1];
					tmp = drive.freq[0] << 8;
					tmp |= drive.freq[1];
					set_freq(tmp);
				}
				duty = drive.right_duty1;
				set_duty(&htim3,duty,TIM_CHANNEL_4);
				HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_4);
			}
		}
		else if(drive.right_duty1 ^ drive.right_duty_bk1){
			drive.right_duty_bk1 = drive.right_duty1;

			duty = drive.right_duty1;
			set_duty(&htim3,duty,TIM_CHANNEL_4);
		}
		//enable PWM ENA
		if(HAL_GPIO_ReadPin(PWM_ENA_GPIO_Port,PWM_ENA_Pin) == GPIO_PIN_RESET){
			//GPIO_PIN_SET/GPIO_PIN_RESET = 0U,
			HAL_GPIO_WritePin(PWM_ENA_GPIO_Port,PWM_ENA_Pin,GPIO_PIN_SET);
		}
	}
	else{
		if(drive.right_on1 ^ drive.right_on_bk1){
			drive.right_on_bk1 = drive.right_on1;
			//set_duty(&htim3,drive.right_duty,TIM_CHANNEL_2);
			HAL_TIM_PWM_Stop(&htim3,TIM_CHANNEL_4);
		}
	}

	if((drive.left_on == 0) && (drive.left_on1 == 0) && (drive.right_on == 0) && (drive.right_on1 == 0)){
		//disable PWM ENA
		if(HAL_GPIO_ReadPin(PWM_ENA_GPIO_Port,PWM_ENA_Pin) == GPIO_PIN_SET){
			//GPIO_PIN_SET/GPIO_PIN_RESET = 0U,
			HAL_GPIO_WritePin(PWM_ENA_GPIO_Port,PWM_ENA_Pin,GPIO_PIN_RESET);
		}
	}
}


