TranNguyenDung/STM32_Xe/Program/program_00_02.c
//Set duty
//duty(0% <-> 100%)
void set_duty(TIM_HandleTypeDef *htim,unsigned char duty,unsigned long channel)
{
	unsigned long ccnt;
	unsigned long value;
	ccnt = htim3.Instance->ARR;

	value = ccnt * duty / 100;

	if(channel == TIM_CHANNEL_1){
		htim3.Instance->CCR1 = value;
		//htim.Instance->CCR1 = value;
	}
	else if(channel == TIM_CHANNEL_2){
		htim3.Instance->CCR2 = value;
		//htim.Instance->CCR2 = value;
	}
	else if(channel == TIM_CHANNEL_3){
		htim3.Instance->CCR3 = value;
		//htim.Instance->CCR3 = value;
	}
	else if(channel == TIM_CHANNEL_4){
		htim3.Instance->CCR4 = value;
		//htim.Instance->CCR4 = value;
	}

}

//set freqency PWM
void set_freq(unsigned short value)
{
	htim3.Instance->ARR = value;
}
/*----------------------------------------------------------------*/











/*----------------------------------------------------------------*/
//Process data UART2 IR
void serial2_comm(void)
{
	//unsigned char *pos;
	//unsigned char i;

	//
	if(r1_flg){
		r1_flg = 0;

		//Serial.write(&r2_buff[0],r2_pos);
		//pos = &r1_buff[0];
		if((r1_buff[0] == IR_CMD_RUN) && (r1_buff[1] == 0x0D) && (r1_buff[2] == 0x0A)){
			ir_new_data_flg = 1;
			ir_new_data_type = IR_CMD_RUN;
			//SEND SYSTEM I AM RUN
			IR_Send(IR_CMD_OK);
		}
		else if((r1_buff[0] == IR_CMD_STOP) && (r1_buff[1] == 0x0D) && (r1_buff[2] == 0x0A)){
			ir_new_data_flg = 1;
			ir_new_data_type = IR_CMD_STOP;
			//SEND SYSTEM I AM STOP
			IR_Send(IR_CMD_OK);
		}
		//IR get OK then stop send
		else if((r1_buff[0] == IR_CMD_OK) && (r1_buff[1] == 0x0D) && (r1_buff[2] == 0x0A)){
			//ir_new_data_flg = 1;
			//ir_new_data_type = IR_CMD_OK;
			//Finsh send to
			ir_send_must_ok_flg = 0;
			ir_send_must_ok_type = 0;
			ir_send_must_ok_tm = 0;
			set_ir_send_must_ok(0,OFF,0);
		}
		else if((r1_buff[0] == IR_CMD_NG) && (r1_buff[1] == 0x0D) && (r1_buff[2] == 0x0A)){
			//ir_new_data_flg = 1;
			//ir_new_data_type = IR_CMD_NG;
		}
		else{
			//ir_new_data_flg = 0;
			//ir_new_data_type = 0;
		}

		r1_pos = 0;
	}

	//SEND DATA
	if(ir_send_must_ok_flg){
		if(ir_send_must_ok_tm == 0){
			//Send to speed [VE PHAT GIOI]
			if(ir_send_must_ok_type == IR_CMD_VE_PG){
				IR_Send(IR_CMD_VE_PG);
				//Serial.println("IR_CMD_VE_PG");
			}
			//Send to speed [THUOC CONG THUC]
			else if(ir_send_must_ok_type == IR_CMD_THUOC_CT){
				IR_Send(IR_CMD_THUOC_CT);
				//Serial.println("IR_CMD_THUOC_CT");
			}
			//Send to speed [KHONG THUOC CONG THUC]
			else if(ir_send_must_ok_type == IR_CMD_KHONG_THUOC_CT){
				IR_Send(IR_CMD_KHONG_THUOC_CT);
				//Serial.println("IR_CMD_KHONG_THUOC_CT");
			}
			//Send to speed [BUONG]
			else if(ir_send_must_ok_type == IR_CMD_BUONG){
				IR_Send(IR_CMD_BUONG);
				//Serial.println("IR_CMD_BUONG");
			}
			else if(ir_send_must_ok_type == IR_CMD_KHONG_VE_PG){
				IR_Send(IR_CMD_KHONG_VE_PG);
				//Serial.println("IR_CMD_KHONG_VE_PG");
			}
			ir_send_must_ok_tm = 50;//500ms	

			if(ir_send_must_ok_tmr > 1){
				ir_send_must_ok_tmr--;
				if(ir_send_must_ok_tmr == 1){
					ir_send_must_ok_tmr = 0;
					ir_send_must_ok_flg = 0;
					ir_send_must_ok_tm = 0;
				}
			}
		}
	}
}


//send data to module IR
void IR_Send(unsigned char data)
{
	unsigned char* pos;
	unsigned char i;

	pos = &t1_buff[0];
	i = 0;
	*(pos + i++) = 0xFA;
	*(pos + i++) = 0xF1;
	*(pos + i++) = data;
	*(pos + i++) = 0x0D;
	*(pos + i++) = 0x0A;
	HAL_UART_Transmit_IT(&huart1,pos,i);
}

//send ir send must ok
//value [len = 1] => forever send
//value [len != 1 && len > 0 then send len]
void set_ir_send_must_ok(unsigned char type,unsigned char on_off,unsigned char len)
{
	if(on_off){
		ir_send_must_ok_flg = 1;
		ir_send_must_ok_type = type;
		ir_send_must_ok_tm = 0;
		ir_send_must_ok_tmr = len + 1;
	}
	else{
		ir_send_must_ok_flg = 0;
		ir_send_must_ok_type = 0;
		ir_send_must_ok_tm = 0;
		ir_send_must_ok_tmr = 0;
	}
}

/*----------------------------------------------------------------*/





/*----------------------------------------------------------------*/
//Communication with due arduino
void uart2_with_due(void)
{
	unsigned char* pos;
	unsigned char data;
	//unsigned short i;
	//unsigned char tmp;
	//struct st_IR_Format ir_tmp;

	if(r2_flg){
		pos = &r2_buff[3];
		if(string_compera(pos,"INFO#")){
			u2_send_str("BAN QUYEN CHUA THIEN TONG TAN DIEU",sizeof("BAN QUYEN CHUA THIEN TONG TAN DIEU"));
		}
		else if(string_compera(pos,"FACTW#")){
			if(get_fact()){
				uart2_send_nak();
			}
			else{
				uart2_send_ack();
			}
		}
		else if(string_compera(pos,"FACTR#")){
			if(read_fact()){
				uart2_send_buff(&fact.header[0],sizeof(fact));
			}
			else{
				uart2_send_ack();
			}
		}
		else if(string_compera(pos,"#GETRGB")){
			pos += strlen("GETRGB");
			if(ascii2bin(pos,&data,1)){
				if(data < 5){
					send_couter_rgb(data);
				}
				else{
					u2_send_str("NG",2);
				}
			}
			else{
				u2_send_str("NG",2);
			}
		}
		//Other
		else{
			u2_send_str("NG",2);
		}

		#if 0
		//TT~xx...	[xx: address module]		
		//Get addr
		if(ascii2bin(pos,&tmp,1)){
			pos += 2;
			//check addr
			if((tmp == addr_module) || (tmp == 0xFF)){
				//-----------------------------------------
				//SEND INFO
				if(string_compera(pos,"INFO#")){
					u2_send_addr_data_str("BAN QUYEN CHUA THIEN TONG TAN DIEU",sizeof("BAN QUYEN CHUA THIEN TONG TAN DIEU"));
				}
				//-----------------------------------------
				//CHECK MODULE
				else if(string_compera(pos,"CHK#")){
					u2_send_addr_data_str("OK",sizeof("OK"));
				}
				//ADDR MODULE WRITE
				else if(string_compera(pos,"ADDRW#")){//FORMAT WHILE ADDR [TT~ADDRWaa] "aa" là địa chỉ
					pos += strlen("ADDRW");
					if(ascii2bin(pos,&tmp,1)){
						//Flash_Erase(ADDR_MODULE);
						//Flash_Write_Int(ADDR_MODULE,tmp);
						addr_module = tmp;
						u2_send_addr_data_str("OK",sizeof("OK"));
					}
					else{
						u2_send_addr_data_str("NG",sizeof("NG"));
					}
				}
				//ADDR MODULE READ
				else if(string_compera(pos,"ADDRR#")){
					//uart2_send_nak();
					//tmp = (unsigned char) Flash_Read_Int(ADDR_MODULE);
					addr_module = tmp;
					uart2_send_buff(&tmp,1);
				}
				//-----------------------------------------
				//IR Send to car
				else if(string_compera(pos,"IRSEND#")){
					pos += strlen("IRSEND");
					if(ascii2bin(pos,&ir_tmp.data[0],3)){
						//addr_module;
						IR_Format.addr = 0xFA;//địa chỉ chung của module
						IR_Format.cmd = 0xF1;//cmd
						IR_Format.data[0] = ir_tmp.data[0];
						IR_Format.data[1] = ir_tmp.data[1];
						IR_Format.data[2] = ir_tmp.data[2];
						IR_Send(IR_Format.data[0]);
						u2_send_addr_data_str("OK",sizeof("OK"));
					}
					else{
						u2_send_addr_data_str("NG",sizeof("NG"));
					}
				}

				//-----------------------------------------
				//SEND SCAN IR ON
				else if(string_compera(pos,"SCANON#")){
					//pos += strlen("SCANON");
					ir_scan_flg = 1;
					u2_send_addr_data_str("OK",sizeof("OK"));
				}
				//SEND SCAN IR OFF
				else if(string_compera(pos,"SCANOFF#")){
					//pos += strlen("SCANOFF");
					ir_scan_flg = 0;
					u2_send_addr_data_str("OK",sizeof("OK"));
				}
				//SEND SCAN IR
				else if(string_compera(pos,"SCAN#")){
					//pos += strlen("SCAN");
					ir_scan_flg = 1;
					u2_send_addr_data_str("OK",sizeof("OK"));
				}

				//SEND CAR RUN 
				else if(string_compera(pos,"RUN#")){
					ir_run_flg = 1;
					ir_run_OnOff = 1;
					u2_send_addr_data_str("OK",sizeof("OK"));
				}

				//-----------------------------------------
				//DUE SEND OF
				else if(string_compera(pos,"OK#")){
					send_due_flg = 0;
					send_due_tm = 0;
					send_due_type = TYPE_SEND_DUE_NULL;
				}

				//other
				else{
					if(tmp != 0xFF){
						u2_send_addr_data_str("NG",sizeof("NG"));
					}
				}
			}
			//Other
			else{

