TranNguyenDung/STM32_Xe/Program/program_00_02.c
			}
		}
		else{
        }
		#endif // 0




		r2_flg = 0;
		r2_pos = 0;
	}

	//send to due if have event car
	if(send_due_flg){
		if(send_due_tm == 0){
			//KHI XE DEN DIEM VA GUI LENH LEN
			if(send_due_type == TYPE_SEND_DUE_CAR){
				u2_send_addr_data_str("CAR",sizeof("CAR"));
			}
			//KHI ONG THAN TRUONG HOP CONG DUC VA PHUOC DUC BANG NHAU HOI
			else if(send_due_type == TYPE_SEND_DUE_VE_PG){
				u2_send_addr_data_str("VE",sizeof("VE"));
			}
			//KHI ONG THAN HOI CO THUOC CONG DUC KHONG
			else if(send_due_type == TYPE_SEND_DUE_THUOC_CT){
				u2_send_addr_data_str("THUOC",sizeof("THUOC"));
			}
			//KHI ONG THAN HOI CO THUOC CONG DUC KHONG
			else if(send_due_type == TYPE_SEND_DUE_KHONG_THUOC_CT){
				u2_send_addr_data_str("KHONG",sizeof("KHONG"));
			}
			//KHI THANH - THANH - DONG TOC NIU KEO LAI THE GIOI LUAN HOI
			else if(send_due_type == TYPE_SEND_DUE_BUONG){
				u2_send_addr_data_str("BUONG",sizeof("BUONG"));
			}
			send_due_tm = 150;//1s
		}

	}

}

//send couter rgb
void send_couter_rgb(unsigned char chanle)
{
	unsigned char *pos;
	unsigned char buff[64];
	unsigned char i;

	i = 0;
	//red
	buff[i++] = (rgb_ch[chanle].freq_red_ct & 0xFF000000) >> 24;
	buff[i++] = (rgb_ch[chanle].freq_red_ct & 0xFF0000) >> 16;
	buff[i++] = (rgb_ch[chanle].freq_red_ct & 0xFF00) >> 8;
	buff[i++] = (rgb_ch[chanle].freq_red_ct & 0xFF) >> 0;
	//green
	buff[i++] = (rgb_ch[chanle].freq_green_ct & 0xFF000000) >> 24;
	buff[i++] = (rgb_ch[chanle].freq_green_ct & 0xFF0000) >> 16;
	buff[i++] = (rgb_ch[chanle].freq_green_ct & 0xFF00) >> 8;
	buff[i++] = (rgb_ch[chanle].freq_green_ct & 0xFF) >> 0;
	//blue
	buff[i++] = (rgb_ch[chanle].freq_blue_ct & 0xFF000000) >> 24;
	buff[i++] = (rgb_ch[chanle].freq_blue_ct & 0xFF0000) >> 16;
	buff[i++] = (rgb_ch[chanle].freq_blue_ct & 0xFF00) >> 8;
	buff[i++] = (rgb_ch[chanle].freq_blue_ct & 0xFF) >> 0;
	//no fiter
	buff[i++] = (rgb_ch[chanle].freq_nofiter_ct & 0xFF000000) >> 24;
	buff[i++] = (rgb_ch[chanle].freq_nofiter_ct & 0xFF0000) >> 16;
	buff[i++] = (rgb_ch[chanle].freq_nofiter_ct & 0xFF00) >> 8;
	buff[i++] = (rgb_ch[chanle].freq_nofiter_ct & 0xFF) >> 0;
	pos = &buff[0];
	uart2_send_buff(pos,i);
}

//get fact data
unsigned char get_fact()
{
	struct stfact tmp;
	unsigned char *s_pos;
	unsigned char *d_pos;
	//unsigned short i;
	//unsigned short j;
	unsigned char flg;

	//get data to tmp
	//TT~FACTW...
	s_pos = &r2_buff[8];
	d_pos = &tmp.header[0];
	//if ok then retun 1/ not ok then return 0
	flg = ascii2bin(s_pos,d_pos,sizeof(tmp));

	//check data
	//flg = 1;
	if(tmp.header[0] != 0x55){
		flg = 0;
	}
	else if(tmp.header[1] != 0xAA){
		flg = 0;
	}
	else if(tmp.footer[0] != 0x55){
		flg = 0;
	}
	else if(tmp.footer[1] != 0xAA){
		flg = 0;
	}
	else{
		//copy data from tmp to fact
		fact = tmp;
		write_fact();
	}
	return flg;
}

//send buff hex convert to ascii
void uart2_send_buff(unsigned char* s_pos,unsigned short len)
{
	unsigned char* d_pos;
	unsigned short i;
	i = len * 2;
	d_pos = &t2_buff[0];
	bin2ascii(s_pos,d_pos,len);
	*(d_pos + i++) = 0x0D;
	*(d_pos + i++) = 0x0A;
	HAL_UART_Transmit_IT(&huart2,d_pos,i);
}

//send tring and hex
void uart2_send_plus(unsigned char* str_pos,unsigned short str_len,unsigned char* hex_pos,unsigned short hex_len)
{
	unsigned char* d_pos;
	unsigned short i;
	unsigned short j;
	j = 0;
	d_pos = &t2_buff[0];
	//string copy
	for(i = 0;i < str_len;i++){
		*(d_pos + j++) = *(str_pos + i);
	}
	//Hex copy
	bin2ascii(hex_pos,(d_pos + j++),hex_len);
	
	*(d_pos + str_len + hex_len * 2 + 0) = 0x0D;
	*(d_pos + str_len + hex_len * 2 + 1) = 0x0A;
	HAL_UART_Transmit_IT(&huart2,d_pos,str_len + hex_len * 2 + 2);
}

//uart2 send string
void uart2_send_string(char *s_pos,unsigned short len)
{
	unsigned char* d_pos;
	unsigned short i;
	d_pos = &t2_buff[0];
	for(i = 0;i < len;i++){
		*(d_pos + i) = *(s_pos + i);
	}
	*(d_pos + i++) = 0x0D;
	*(d_pos + i++) = 0x0A;
	HAL_UART_Transmit_IT(&huart2,d_pos,i);
}

//send nak/ok
void uart2_send_nak()
{
	unsigned char* pos;
	unsigned char i;
	pos = &t2_buff[0];
	i = 0;
	*(pos + i++) = 'O';
	*(pos + i++) = 'K';
	*(pos + i++) = 0x0D;
	*(pos + i++) = 0x0A;
	HAL_UART_Transmit_IT(&huart2,pos,i);
}

//send ack/ng
void uart2_send_ack(void)
{
	unsigned char* pos;
	unsigned char i;
	pos = &t2_buff[0];
	i = 0;
	*(pos + i++) = 'N';
	*(pos + i++) = 'G';
	*(pos + i++) = 0x0D;
	*(pos + i++) = 0x0A;
	HAL_UART_Transmit_IT(&huart2,pos,i);
}

//uart2 send and address
void u2_send_addr_data_str(char* s_pos,unsigned short len)
{
	unsigned char* d_pos;
	unsigned short i;
	unsigned short j;
	unsigned char tmp[2];

	d_pos = &t2_buff[0];
	i = 0;
	j = 0;
	*(d_pos + i++) = 'T';
	*(d_pos + i++) = 'T';
	*(d_pos + i++) = '~';
	bin2ascii(&addr_module,&tmp[0],1);
	*(d_pos + i++) = tmp[0];
	*(d_pos + i++) = tmp[1];

	for(j = 0;j < len;j++){
		*(d_pos + i++) = *(s_pos + j);
	}
	*(d_pos + i++) = 0x0D;
	*(d_pos + i++) = 0x0A;
	HAL_UART_Transmit_IT(&huart2,d_pos,i);
}


//u2 send string
//uart2 send and address
void u2_send_str(char *s_pos,unsigned short len)
{
	unsigned char *d_pos;
	unsigned short i,j;

	d_pos = &t2_buff[0];
	i = 0;
	*(d_pos + i++) = 'T';
	*(d_pos + i++) = 'T';
	*(d_pos + i++) = '~';

	for(j = 0;j < len;j++){
		*(d_pos + i++) = *(s_pos + j);
	}
	*(d_pos + i++) = 0x0D;
	*(d_pos + i++) = 0x0A;
	HAL_UART_Transmit_IT(&huart2,d_pos,i);
}
/*----------------------------------------------------------------*/








/*----------------------------------------------------------------*/
//with module Bluetooth
void serial3_communication()
{
	unsigned short i;
	unsigned char *pos;
	//unsigned char dmy;

	if(r3_flg){
		r3_flg = 0;
		//Clear buff
		pos = &bluetooth_buff[0];
		for(i = 0;i < sizeof(bluetooth_buff);i++){
			*(pos + i) = 0;
		}

		//s1_send_buff(&bluetooth_buff[0],sizeof(bluetooth_buff));
		utf8_to_ascii(&r3_buff[0],r3_pos,&bluetooth_buff[0],&bluetooth_len);//Data type utf8 sang kiểu ascii không dấu
		Upper(&bluetooth_buff[0],bluetooth_len);//Chử in hoa hóa
		//s1_send_buff(&bluetooth_buff[0], bluetooth_len);
		bluetooth_flg = 1;

		//clear buff r3_buff
        //Serial.println("â");
		for(i = 0;i < sizeof(r3_buff);i++){
			if(r3_buff[i]){
				r3_buff[i] = 0;
			}
			else{
				//break;
			}
		}
		r3_pos = 0;

