TranNguyenDung/STM32_Xe/Program/program_00_02.c
		//HAL_UART_DeInit(&huart3);
		HAL_UART_Receive_IT(&huart3,&r3_buff2[0],128);
	}
	//--------------------------------------------------


	//dmy = strlenght("MUON VE PHAT GIOI");
	//Serial.println(dmy);

	if(bluetooth_flg){
		bluetooth_flg = 0;

		//s0_send_buff(&bluetooth_buff[0], bluetooth_len);
		//s1_send_buff(&bluetooth_buff[0],bluetooth_buff);
		//VỀ PHẬT GIỚI
		//KHÔNG VỀ PHẬT GIỚI
		//KHÔNG MUỐN VỀ PHẬT GIỚI
		//ĐI HƯỠNG PHƯỚC ĐỨC
		//KHÔNG MUỐN ĐI HƯỠNG PHƯỚC
		//MUỐN GIẢI THOÁT


		//ĐI LUÂN HỒI
		//KHÔNG MUỐN ĐI LUÂN HỒI
		//dmy = strlenght("MUON VE PHAT GIOI");
		//Serial.println(dmy);
		//Serial1.println("Xin Chào");
		#if 1
		pos = &bluetooth_buff[0];
		if(str_compare(pos,"KHONG MUON VE PHAT GIOI",bluetooth_len)){
			//Serial.println("TH01");
			//Serial.println("TH07");
			set_ir_send_must_ok(IR_CMD_KHONG_VE_PG,ON,10);
		}
		else if(str_compare(pos,"MUON VE PHAT GIOI",bluetooth_len)){
			//Serial.println("TH02");
		  //Serial.println("TH08");	
			set_ir_send_must_ok(IR_CMD_VE_PG,ON,10);
		}
		else if(str_compare(pos,"KHONG MUON DE PHAT GIOI",bluetooth_len)){
			//Serial.println("TH03");
			//Serial.println("TH07");
			set_ir_send_must_ok(IR_CMD_KHONG_VE_PG,ON,10);
		}
		else if(str_compare(pos,"MUON DE PHAT GIOI",bluetooth_len)){
			//Serial.println("TH04");
			//Serial.println("TH08");	
			set_ir_send_must_ok(IR_CMD_VE_PG,ON,10);
		}
		else if(str_compare(pos,"KHONG MUON GIAI THOAT",bluetooth_len)){
			//Serial.println("TH05");
			//Serial.println("TH07");
			set_ir_send_must_ok(IR_CMD_KHONG_VE_PG,ON,10);
		}
		else if(str_compare(pos,"MUON GIAI THOAT",bluetooth_len)){
			//Serial.println("TH06");
			//Serial.println("TH08");	
			set_ir_send_must_ok(IR_CMD_VE_PG,ON,10);
		}
		//----------------------------------------------
		//BUONG TH2: CONG DUC = PHUOC DUC: KHONG VE
		else if(str_compare(pos,"KHONG VE",bluetooth_len)){
			//Serial.println("TH07");
			set_ir_send_must_ok(IR_CMD_KHONG_VE_PG,ON,10);
		}
		//BUONG TH2: CONG DUC = PHUOC DUC: KHONG VE
		else if(str_compare(pos,"KHONG MUON VE",bluetooth_len)){
			//Serial.println("TH07");
			set_ir_send_must_ok(IR_CMD_KHONG_VE_PG,ON,10);
		}
		//BUONG TH2: CONG DUC = PHUOC DUC: KHONG VE
		else if(str_compare(pos,"KHONG MUN VE",bluetooth_len)){
			//Serial.println("TH07");
			set_ir_send_must_ok(IR_CMD_KHONG_VE_PG,ON,10);
		}
		//BUONG TH2: CONG DUC = PHUOC DUC: KHONG VE
		else if(str_compare(pos,"KHONG MON VE",bluetooth_len)){
			//Serial.println("TH07");
			set_ir_send_must_ok(IR_CMD_KHONG_VE_PG,ON,10);
		}
		//BUONG TH2: CONG DUC = PHUOC DUC: KHONG VE
		else if(str_compare(pos,"KHONG ZE",bluetooth_len)){
			//Serial.println("TH07");
			set_ir_send_must_ok(IR_CMD_KHONG_VE_PG,ON,10);
		}
		//BUONG TH2: CONG DUC = PHUOC DUC: VE
		else if(str_compare(pos,"VE",bluetooth_len)){
			//Serial.println("TH08");	
			set_ir_send_must_ok(IR_CMD_VE_PG,ON,10);
		}
		//BUONG TH2: CONG DUC = PHUOC DUC: VE
		else if(str_compare(pos,"MUON VE",bluetooth_len)){
			//Serial.println("TH08");	
			set_ir_send_must_ok(IR_CMD_VE_PG,ON,10);
		}
		//BUONG TH2: CONG DUC = PHUOC DUC: VE
		else if(str_compare(pos,"MON VE",bluetooth_len)){
			//Serial.println("TH08");	
			set_ir_send_must_ok(IR_CMD_VE_PG,ON,10);
		}
		//BUONG TH2: CONG DUC = PHUOC DUC: VE
		else if(str_compare(pos,"MUN VE",bluetooth_len)){
			//Serial.println("TH08");	
			set_ir_send_must_ok(IR_CMD_VE_PG,ON,10);
		}
		//BUONG TH2: CONG DUC = PHUOC DUC: KHONG THUOC
		else if(str_compare(pos,"KHONG THUOC",bluetooth_len)){
			//Serial.println("TH07");
			set_ir_send_must_ok(IR_CMD_KHONG_THUOC_CT,ON,10);
		}
		//BUONG TH2: CONG DUC = PHUOC DUC: THUOC 
		else if(str_compare(pos,"THUOC",bluetooth_len)){
			//Serial.println("TH08");
			set_ir_send_must_ok(IR_CMD_THUOC_CT,ON,10);
		}

		//BUONG TH2: CONG DUC = PHUOC DUC: CO BIET 
		else if(str_compare(pos,"KHONG BIET",bluetooth_len)){
			//Serial.println("TH08");
			set_ir_send_must_ok(IR_CMD_KHONG_THUOC_CT,ON,10);
		}
		//BUONG TH2: CONG DUC = PHUOC DUC: CO BIET 
		else if(str_compare(pos,"CO BIET",bluetooth_len)){
			//Serial.println("TH08");
			set_ir_send_must_ok(IR_CMD_THUOC_CT,ON,10);
		}
		//BUONG TH2: CONG DUC = PHUOC DUC: CO BIET 
		else if(str_compare(pos,"BIET",bluetooth_len)){
			//Serial.println("TH08");
			set_ir_send_must_ok(IR_CMD_THUOC_CT,ON,10);
		}
		//BUONG TH2: CONG DUC = PHUOC DUC: CO BIET 
		else if(str_compare(pos,"BIEC",bluetooth_len)){
			//Serial.println("TH08");
			set_ir_send_must_ok(IR_CMD_THUOC_CT,ON,10);
		}

		//----------------------------------------------

		//BUONG TH3: CONG DUC = PHUOC DUC: 
		else if(str_compare(pos,"BUONG",bluetooth_len)){
			//SEND TO DUE
			set_ir_send_must_ok(IR_CMD_BUONG,ON,10);
		}
		//TH BUONG MEO MIENG THANH [BUON]
		else if(str_compare(pos,"BUON",bluetooth_len)){
			//SEND TO DUE
			set_ir_send_must_ok(IR_CMD_BUONG,ON,10);
		}
		//BUM
		//TH BUONG MEO MIENG THANH [BUM]
		else if(str_compare(pos,"BUM",bluetooth_len)){
			//SEND TO DUE
			set_ir_send_must_ok(IR_CMD_BUONG,ON,10);
		}
		//PHONE
		else if(str_compare(pos,"PHONE",bluetooth_len)){
			//SEND TO DUE
			set_ir_send_must_ok(IR_CMD_BUONG,ON,10);
		}
		//------------------------------------------------------
		else{
			//Serial.println("TH09");
		}
		#endif
	}

}

/*----------------------------------------------------------------*/






/*----------------------------------------------------------------*/
//Interrupt timer
//Interrupt timer 10ms
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef* htim)
{
	if(htim->Instance == TIM1){
		htim1_flg = 1;
		timer_couter();
		//rgb_pwm();
		pwm_drive_opera();
	}
	#if 0
	else if(htim->Instance == TIM2){
		//HAL_GPIO_TogglePin(TEST02_GPIO_Port,TEST02_Pin);
}
	else if(htim->Instance == TIM5){

	}
	#endif // 0

	
}

//Interrupt UART
void HAL_UART_RxCpltCallback(UART_HandleTypeDef* huart)
{
	unsigned short i;
	unsigned char *pos;
	//Module IR
	if(huart->Instance == USART1)
	{
		pos = &r1_buff2[0];
		for(i = 0;i < sizeof(r1_buff2);i++){
			*(pos + i) = 0;
		}
		HAL_UART_Receive_IT(&huart1,&r1_buff2[0],sizeof(r1_buff2));	//Kich hoat UART nhan du lieu ngat moi luc
	}

