TranNguyenDung/STM32_Xe/Program/program_00_02.c
	//With PC
	if(huart->Instance == USART2)	//UART hien tai la uart3
	{
		pos = &r2_buff2[0];
		for(i = 0;i < sizeof(r2_buff2);i++){
			*(pos + i) = 0;
		}
		HAL_UART_Receive_IT(&huart2,&r2_buff2[0],sizeof(r2_buff2));
	}

	//With bluetooth
	if(huart->Instance == USART3)	//UART hien tai la uart3
	{
		pos = &r3_buff2[0];
		for(i = 0;i < sizeof(r3_buff2);i++){
			*(pos + i) = 0;
		}
		HAL_UART_Receive_IT(&huart3,&r3_buff2[0],sizeof(r3_buff2));
	}

}

//irq uart1 rx it
unsigned char uart1_rx_it(unsigned char data)
{
	if(r1_flg == 0){
		r1_buff[r1_pos++] = data;
		//r1_flg = 1;
		r1_tm = 5;
	}

	return 1;
}

//irq uart2 rx it
unsigned char uart2_rx_it(unsigned char data)
{
	unsigned char flg;
	//Status free
	flg = 0;
	if(r2_flg == 0){
		if(r2_pos == 0){
			if(data == 'T'){
				r2_buff[r2_pos++] = data;
			}
		}
		else if(r2_pos == 1){
			if(data == 'T'){
				r2_buff[r2_pos++] = data;
			}
			else{
				r2_pos = 0;
			}
		}
		else if(r2_pos == 2){
			if(data == '~'){
				r2_buff[r2_pos++] = data;
			}
			else{
				r2_pos = 0;
			}
		}
		else{
			r2_buff[r2_pos++] = data;
			if(r2_pos >= sizeof(r2_buff)){
				r2_pos = 0;
				flg = 1;
				//HAL_UART_Receive_IT(&huart2,&r2_buff[0],sizeof(r2_buff));
			}
			else if((r2_buff[r2_pos - 2] == 0x0D) && (r2_buff[r2_pos - 1] == 0x0A)){
				r2_flg = 1;
				flg = 1;
				//HAL_UART_Receive_IT(&huart2,&r2_buff[0],sizeof(r2_buff));
			}
		}
	}
	return flg;
}

//uart for bluetooth
unsigned char uart3_rx_it(unsigned char data) 
{
	r3_buff[r3_pos++] = data;
	r3_tot = 50;
	return 0;
}

#if 0
//For STM32F103
/**
  * @brief  Receives an amount of data in non blocking mode
  * @param  huart: pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval HAL status
  */
static HAL_StatusTypeDef UART_Receive_IT(UART_HandleTypeDef* huart)
{
	uint16_t* tmp;
	unsigned char data;

	/* Check that a Rx process is ongoing */
	if(huart->RxState == HAL_UART_STATE_BUSY_RX){
		if(huart->Init.WordLength == UART_WORDLENGTH_9B){
			tmp = (uint16_t*) huart->pRxBuffPtr;
			if(huart->Init.Parity == UART_PARITY_NONE){
				*tmp = (uint16_t) (huart->Instance->DR & (uint16_t) 0x01FF);
				huart->pRxBuffPtr += 2U;
			}
			else{
				*tmp = (uint16_t) (huart->Instance->DR & (uint16_t) 0x00FF);
				huart->pRxBuffPtr += 1U;
			}
		}
		else{
			if(huart->Init.Parity == UART_PARITY_NONE){
				//*huart->pRxBuffPtr++ = (uint8_t)(huart->Instance->DR & (uint8_t)0x00FF);
				data = (uint8_t) (huart->Instance->DR & (uint8_t) 0x00FF);
				*huart->pRxBuffPtr++ = data;
			}
			else{
				*huart->pRxBuffPtr++ = (uint8_t) (huart->Instance->DR & (uint8_t) 0x007F);
			}
		}

		if(--huart->RxXferCount == 0U){
			/* Disable the IRDA Data Register not empty Interrupt */
			__HAL_UART_DISABLE_IT(huart,UART_IT_RXNE);

			/* Disable the UART Parity Error Interrupt */
			__HAL_UART_DISABLE_IT(huart,UART_IT_PE);
			/* Disable the UART Error Interrupt: (Frame error, noise error, overrun error) */
			__HAL_UART_DISABLE_IT(huart,UART_IT_ERR);

			/* Rx process is completed, restore huart->RxState to Ready */
			huart->RxState = HAL_UART_STATE_READY;

			HAL_UART_RxCpltCallback(huart);

			return HAL_OK;
		}

		if(huart->Instance == USART1){
			if(uart1_rx_it(data)){
				/* Disable the IRDA Data Register not empty Interrupt */
				__HAL_UART_DISABLE_IT(huart,UART_IT_RXNE);

				/* Disable the UART Parity Error Interrupt */
				__HAL_UART_DISABLE_IT(huart,UART_IT_PE);
				/* Disable the UART Error Interrupt: (Frame error, noise error, overrun error) */
				__HAL_UART_DISABLE_IT(huart,UART_IT_ERR);

				/* Rx process is completed, restore huart->RxState to Ready */
				huart->RxState = HAL_UART_STATE_READY;

				HAL_UART_RxCpltCallback(huart);

				return HAL_OK;
			}
		}

		if(huart->Instance == USART2){
			if(uart2_rx_it(data)){
				/* Disable the IRDA Data Register not empty Interrupt */
				__HAL_UART_DISABLE_IT(huart,UART_IT_RXNE);

				/* Disable the UART Parity Error Interrupt */
				__HAL_UART_DISABLE_IT(huart,UART_IT_PE);
				/* Disable the UART Error Interrupt: (Frame error, noise error, overrun error) */
				__HAL_UART_DISABLE_IT(huart,UART_IT_ERR);

				/* Rx process is completed, restore huart->RxState to Ready */
				huart->RxState = HAL_UART_STATE_READY;

				HAL_UART_RxCpltCallback(huart);

				return HAL_OK;
			}
		}

		if(huart->Instance == USART3){
			if(uart3_rx_it(data)){
				/* Disable the IRDA Data Register not empty Interrupt */
				__HAL_UART_DISABLE_IT(huart,UART_IT_RXNE);

				/* Disable the UART Parity Error Interrupt */
				__HAL_UART_DISABLE_IT(huart,UART_IT_PE);
				/* Disable the UART Error Interrupt: (Frame error, noise error, overrun error) */
				__HAL_UART_DISABLE_IT(huart,UART_IT_ERR);

				/* Rx process is completed, restore huart->RxState to Ready */
				huart->RxState = HAL_UART_STATE_READY;

				HAL_UART_RxCpltCallback(huart);

				return HAL_OK;
			}
		}
		return HAL_OK;
	}
	else{
		return HAL_BUSY;
	}
}
#endif // 0

#if 0
//For STM32F7
/**
  * @brief RX interrrupt handler for 7 or 8 bits data word length .
  * @param huart UART handle.
  * @retval None
  */
static void UART_RxISR_8BIT(UART_HandleTypeDef *huart)
{
	uint16_t uhMask = huart->Mask;
	uint16_t  uhdata;
	unsigned char data;

	/* Check that a Rx process is ongoing */
	if(huart->RxState == HAL_UART_STATE_BUSY_RX){
		uhdata = (uint16_t) READ_REG(huart->Instance->RDR);
		data = (uint8_t) (uhdata & (uint8_t) uhMask);


		#if 1
		* huart->pRxBuffPtr = (uint8_t) (uhdata & (uint8_t) uhMask);
		huart->pRxBuffPtr++;
		huart->RxXferCount--;

		if(huart->RxXferCount == 0U){
			/* Disable the UART Parity Error Interrupt and RXNE interrupts */
			CLEAR_BIT(huart->Instance->CR1,(USART_CR1_RXNEIE_RXFNEIE | USART_CR1_PEIE));

			/* Disable the UART Error Interrupt: (Frame error, noise error, overrun error) */
			CLEAR_BIT(huart->Instance->CR3,USART_CR3_EIE);

			/* Rx process is completed, restore huart->RxState to Ready */
			huart->RxState = HAL_UART_STATE_READY;

			/* Clear RxISR function pointer */
			huart->RxISR = NULL;

			#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
			/*Call registered Rx complete callback*/
			huart->RxCpltCallback(huart);
			#else
			/*Call legacy weak Rx complete callback*/
			HAL_UART_RxCpltCallback(huart);
			#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
	}

		//----------------------------------
		if(huart->Instance == USART1){
			if(uart1_rx_it(data)){
				/* Disable the UART Parity Error Interrupt and RXNE interrupts */
				CLEAR_BIT(huart->Instance->CR1,(USART_CR1_RXNEIE_RXFNEIE | USART_CR1_PEIE));

