TranNguyenDung/STM32_Xe/Program/program_00_02.c
				/* Disable the UART Error Interrupt: (Frame error, noise error, overrun error) */
				CLEAR_BIT(huart->Instance->CR3,USART_CR3_EIE);

				/* Rx process is completed, restore huart->RxState to Ready */
				huart->RxState = HAL_UART_STATE_READY;

				/* Clear RxISR function pointer */
				huart->RxISR = NULL;

				/*Call legacy weak Rx complete callback*/
				HAL_UART_RxCpltCallback(huart);

				//return HAL_OK;
			}
		}

		if(huart->Instance == USART2){
			if(uart2_rx_it(data)){
				/* Disable the UART Parity Error Interrupt and RXNE interrupts */
				CLEAR_BIT(huart->Instance->CR1,(USART_CR1_RXNEIE_RXFNEIE | USART_CR1_PEIE));

				/* Disable the UART Error Interrupt: (Frame error, noise error, overrun error) */
				CLEAR_BIT(huart->Instance->CR3,USART_CR3_EIE);

				/* Rx process is completed, restore huart->RxState to Ready */
				huart->RxState = HAL_UART_STATE_READY;

				/* Clear RxISR function pointer */
				huart->RxISR = NULL;

				/*Call legacy weak Rx complete callback*/
				HAL_UART_RxCpltCallback(huart);

				//return HAL_OK;
			}
		}

		if(huart->Instance == USART3){
			if(uart3_rx_it(data)){
				/* Disable the UART Parity Error Interrupt and RXNE interrupts */
				CLEAR_BIT(huart->Instance->CR1,(USART_CR1_RXNEIE_RXFNEIE | USART_CR1_PEIE));

				/* Disable the UART Error Interrupt: (Frame error, noise error, overrun error) */
				CLEAR_BIT(huart->Instance->CR3,USART_CR3_EIE);

				/* Rx process is completed, restore huart->RxState to Ready */
				huart->RxState = HAL_UART_STATE_READY;

				/* Clear RxISR function pointer */
				huart->RxISR = NULL;

				/*Call legacy weak Rx complete callback*/
				HAL_UART_RxCpltCallback(huart);

				//return HAL_OK;
			}
		}

  }
	else{
		/* Clear RXNE interrupt flag */
		__HAL_UART_SEND_REQ(huart,UART_RXDATA_FLUSH_REQUEST);
	}
	#endif // 0


}

#endif

void HAL_UART_ErrorCallback(UART_HandleTypeDef* huart)
{
	//I implement this .. but eventually you can decide with different approach
	//Many macros/proc on this code .. is just to be a hint (mem/rec about this possibility)
	__HAL_UART_CLEAR_OREFLAG(huart);
	__HAL_UART_CLEAR_NEFLAG(huart);
	__HAL_UART_CLEAR_FEFLAG(huart);
	/* Disable the UART Error Interrupt: (Frame error, noise error, overrun error) */
	__HAL_UART_DISABLE_IT(huart,UART_IT_ERR);
	//The most important thing when UART framing error occur/any error is restart the RX process 
	if(huart->Instance == USART1){
		//Restarting the RX, .. 1 byte. .. u8DATUartShortRxBuffer is My own rx buffer 
		HAL_UART_Receive_IT(&huart1,&r1_buff2[0],sizeof(r1_buff2));
	}
	if(huart->Instance == USART2){
		//Restarting the RX, .. 1 byte. 
		HAL_UART_Receive_IT(&huart2,&r2_buff2[0],sizeof(r2_buff2));
	}
	if(huart->Instance == USART3){
		//Restarting the RX, .. 1 byte. 
		HAL_UART_Receive_IT(&huart3,&r3_buff2[0],sizeof(r3_buff2));

	}
}
/*----------------------------------------------------------------*/





/*---------------------------RGB Detect-------------------------------------*/
//scan_rgb_seq
void rgb_opera(void)
{
	//unsigned char i;
	//unsigned long* pos;
	//Chuan Bi
	if(scan_rgb_seq == 0){
		set_scale_freq(FREQ_HIGH);
		s2_flg = 0;
		s3_flg = 0;		
		scan_rgb_seq++;
		scan_rgb_tm = 0;
		scan_rgb_tm_set = 10;
		//disable PWM ENA
		if(HAL_GPIO_ReadPin(RGB_LED_GPIO_Port,RGB_LED_Pin) == GPIO_PIN_RESET){
			//GPIO_PIN_SET/GPIO_PIN_RESET = 0U,
			HAL_GPIO_WritePin(RGB_LED_GPIO_Port,RGB_LED_Pin,GPIO_PIN_SET);
		}
	}
	//set scan red
	else if(scan_rgb_seq == 1){
		if(scan_rgb_tm == 0){
			if(scan_rgb_seq_bk ^ scan_rgb_seq){
				scan_rgb_seq_bk = scan_rgb_seq;
				scan_rgb_tm = scan_rgb_tm_set;
				//scan_rgb_seq++;
				set_scale_freq(FREQ_HIGH);
				set_fiter(RED_SELECT);
				init_st_rgb_channel(RGB_CH1,RED_SELECT);
				init_st_rgb_channel(RGB_CH2,RED_SELECT);
				init_st_rgb_channel(RGB_CH3,RED_SELECT);
				init_st_rgb_channel(RGB_CH4,RED_SELECT);
				init_st_rgb_channel(RGB_CH5,RED_SELECT);
			}
		}
	}
	//set scan blue
	else if(scan_rgb_seq == 2){
		if(scan_rgb_tm == 0){
			if(scan_rgb_seq_bk ^ scan_rgb_seq){
				scan_rgb_seq_bk = scan_rgb_seq;
				scan_rgb_tm = scan_rgb_tm_set;
				scan_rgb_seq++;
				set_scale_freq(FREQ_HIGH);
				set_fiter(BLUE_SELECT);
				init_st_rgb_channel(RGB_CH1,BLUE_SELECT);
				init_st_rgb_channel(RGB_CH2,BLUE_SELECT);
				init_st_rgb_channel(RGB_CH3,BLUE_SELECT);
				init_st_rgb_channel(RGB_CH4,BLUE_SELECT);
				init_st_rgb_channel(RGB_CH5,BLUE_SELECT);
			}
		}
	}
	//set scan green
	else if(scan_rgb_seq == 3){
		if(scan_rgb_tm == 0){
			if(scan_rgb_seq_bk ^ scan_rgb_seq){
				scan_rgb_seq_bk = scan_rgb_seq;
				scan_rgb_tm = scan_rgb_tm_set;
				scan_rgb_seq++;
				set_scale_freq(FREQ_HIGH);
				set_fiter(GREEN_SELECT);
				init_st_rgb_channel(RGB_CH1,GREEN_SELECT);
				init_st_rgb_channel(RGB_CH2,GREEN_SELECT);
				init_st_rgb_channel(RGB_CH3,GREEN_SELECT);
				init_st_rgb_channel(RGB_CH4,GREEN_SELECT);
				init_st_rgb_channel(RGB_CH5,GREEN_SELECT);
			}
		}
	}
	//set scan no fiter
	else if(scan_rgb_seq == 4){
		if(scan_rgb_tm == 0){
			if(scan_rgb_seq_bk ^ scan_rgb_seq){
				scan_rgb_seq_bk = scan_rgb_seq;
				scan_rgb_tm = scan_rgb_tm_set;
				scan_rgb_seq = 1;
				set_scale_freq(FREQ_HIGH);
				set_fiter(NOFITER_SELECT);
				init_st_rgb_channel(RGB_CH1,NOFITER_SELECT);
				init_st_rgb_channel(RGB_CH2,NOFITER_SELECT);
				init_st_rgb_channel(RGB_CH3,NOFITER_SELECT);
				init_st_rgb_channel(RGB_CH4,NOFITER_SELECT);
				init_st_rgb_channel(RGB_CH5,NOFITER_SELECT);
			}
		}
	}
	else{
		set_scale_freq(FREQ_HIGH);
		scan_rgb_seq = 0;
		scan_rgb_tm = 0;
	}
	
	//-----S0 SET---------
	if(s0_flg ^ s0_bk_flg){
		s0_bk_flg = s0_flg;
		if(s0_flg){
			//S0 set on
			HAL_GPIO_WritePin(S0_GPIO_Port,S0_Pin,GPIO_PIN_SET);
		}
		else{
			//S0 set off
			HAL_GPIO_WritePin(S0_GPIO_Port,S0_Pin,GPIO_PIN_RESET);
		}
	}
	//-----S1 SET---------
	if(s1_flg ^ s1_bk_flg){
		s1_bk_flg = s1_flg;
		if(s1_flg){
			//S0 set on
			HAL_GPIO_WritePin(S1_GPIO_Port,S1_Pin,GPIO_PIN_SET);
		}
		else{
			//S0 set off
			HAL_GPIO_WritePin(S1_GPIO_Port,S1_Pin,GPIO_PIN_RESET);
		}
	}
	//-----S2 SET---------
	if(s2_flg ^ s2_bk_flg){
		s2_bk_flg = s2_flg;
		if(s2_flg){
			//S0 set on
			HAL_GPIO_WritePin(S2_GPIO_Port,S2_Pin,GPIO_PIN_SET);
		}
		else{
			//S0 set off
			HAL_GPIO_WritePin(S2_GPIO_Port,S2_Pin,GPIO_PIN_RESET);
		}
	}
	//-----S3 SET---------
	if(s3_flg ^ s3_bk_flg){
		s3_bk_flg = s3_flg;
		if(s3_flg){
			//S3 set on
			HAL_GPIO_WritePin(S3_GPIO_Port,S3_Pin,GPIO_PIN_SET);
		}
		else{
			//S0 set off
			HAL_GPIO_WritePin(0,S3_Pin,GPIO_PIN_RESET);
		}
	}
	
