TranNguyenDung/STM32_Xe/Program/program_00_02.c
#if 0
	//-----------------------------
	//Set pin LEFT & RIGHT to MEGA
	//HAL_GPIO_TogglePin(LED_TEST1_GPIO_Port,LED_TEST1_Pin);
	//HAL_GPIO_TogglePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin);
	if(rgb_ch[0].freq_red_ave > 7000){
		HAL_GPIO_WritePin(LED_TEST1_GPIO_Port,LED_TEST1_Pin,1);
	}
	else{
		HAL_GPIO_WritePin(LED_TEST1_GPIO_Port,LED_TEST1_Pin,0);
	}
	
	if(rgb_ch[1].freq_red_ave > 7000){
		HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,1);
	}
	else{
		HAL_GPIO_WritePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin,0);
	}
#endif	

	
}

//init struct grb
void init_st_rgb_channel(unsigned char channel,unsigned char rgb)
{
	unsigned long *pos;
	unsigned char i;
	//Red
	if(rgb == RED_SELECT){
		pos = &rgb_ch[channel].freq_red[0];
		rgb_ch[channel].red_pos = 0;
		rgb_ch[channel].red_flg = 0;
	}
	//Green
	else if(rgb == GREEN_SELECT){
		pos = &rgb_ch[channel].freq_green[0];
		rgb_ch[channel].green_pos = 0;
		rgb_ch[channel].green_flg = 0;
	}
	//Blue
	else if(rgb == BLUE_SELECT){
		pos = &rgb_ch[channel].freq_blue[0];
		rgb_ch[channel].blue_pos = 0;
		rgb_ch[channel].blue_flg = 0;
	}
	else{//rgb == NOFITER_SELECT
		pos = &rgb_ch[channel].freq_nofiter[0];
		rgb_ch[channel].nofiter_pos = 0;
		rgb_ch[channel].nofiter_flg = 0;
	}
	
	for(i = 0;i < sizeof(rgb_ch[channel].freq_nofiter) / sizeof(rgb_ch[channel].freq_nofiter[0]);i++){
		*(pos + i) = 0;
	}
}

//OUTPUT_FREQUENCY_SCALING
//set scale frequency
void set_scale_freq(unsigned char scale)
{
	#if 0
	if(scale == POWER_DOWM){//off frequency(0%)
		s0_flg = 0;
		s1_flg = 0;
	}
	else if(scale == FREQ_LOW){//frequency 2% f0 = max 500Khz
		s0_flg = 0;
		s1_flg = 1;
	}
	else if(scale == FREQ_MID){//frequency 20% f0 = max 500Khz
		s0_flg = 1;
		s1_flg = 0;
	}
	else if(scale == FREQ_HIGH){//frequency 100% f0 = max 500Khz
		s0_flg = 1;
		s1_flg = 1;
	}
	else{
		//POWER_DOWM
		s0_flg = 0;
		s1_flg = 0;
	}
	#endif // 0
	//FREQ_HIGH
	s0_flg = 1;
	s1_flg = 1;
}

//set fiter
void set_fiter(unsigned char fiter)
{
	if(fiter == RED_SELECT){
		s2_flg = 0;
		s3_flg = 0;
	}
	else if(fiter == GREEN_SELECT){
		s2_flg = 1;
		s3_flg = 1;
	}
	else if(fiter == BLUE_SELECT){
		s2_flg = 0;
		s3_flg = 1;
	}
	else{//NOFITER_SELECT
		s2_flg = 1;
		s3_flg = 0;
	}
	rgb_ch[RGB_CH1].set_filter_change_delay = scan_rgb_tm_set - 3;
	rgb_ch[RGB_CH2].set_filter_change_delay = scan_rgb_tm_set - 3;
	rgb_ch[RGB_CH3].set_filter_change_delay = scan_rgb_tm_set - 3;
	rgb_ch[RGB_CH4].set_filter_change_delay = scan_rgb_tm_set - 3;
	rgb_ch[RGB_CH5].set_filter_change_delay = scan_rgb_tm_set - 3;
}


void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef* htim)
{
	
	//unsigned long *pos;
	//unsigned long dmy;
	unsigned long tmp;
	unsigned long tmp1;
	//unsigned char i;
	//unsigned char flg;
	unsigned char flg2;
	unsigned char channel;

	flg2 = 0;
	if(htim->Instance == TIM2){
		if(s0_flg || s1_flg){
			
			if(htim->Channel == HAL_TIM_ACTIVE_CHANNEL_1){
				flg2 = 1;
				channel = RGB_CH1;
				tmp1 = __HAL_TIM_GetCompare(&htim2,TIM_CHANNEL_1);
				//tmp1 = __HAL_TIM_GetCounter(&htim2);
				
				#if 1
				if(tmp1 >= rgb_ch[channel].ccr_bk){
					tmp = tmp1 - rgb_ch[channel].ccr_bk;
				}
				else{
					//TIMER 32BIT
					tmp = 0XFFFFFFFF - rgb_ch[channel].ccr_bk + tmp1 + 1;
				}
				#endif
				#if 0
				htim->Instance->CCR1 = 0;
				//__HAL_TIM_SetCompare(&htim2,TIM_CHANNEL_1,0);
				//htim2.Instance->CCR1 = 0;
				tmp = tmp1;
				#endif

				if(rgb_ch[channel].set_filter_change_delay){
					rgb_ch[channel].set_filter_change_delay--;
					//rgb_ch[channel].set_filter_change_delay = 0;
				}
				else{
					//red
					if(RED_CHK){
						//Red_ct = tmp;
						//freq_R = clockCouter / tmp;
						rgb_ch[channel].freq_red_ct = tmp;

						#if 0
						dmy = clockCouter / tmp;
						rgb_ch[channel].freq_red[rgb_ch[channel].red_pos] = dmy;
						rgb_ch[channel].red_pos = (rgb_ch[channel].red_pos + 1) % (sizeof(rgb_ch[channel].freq_red)/ sizeof(rgb_ch[channel].freq_red)[0]);
						if(rgb_ch[channel].red_pos == 0){
							rgb_ch[channel].red_flg = 1;
						}
						rgb_ch[channel].freq_red_ave = dmy;//rgb_ch[channel].freq_red[0];
						#endif

						#if 0
						if(rgb_ch[channel].red_flg){
							pos = &rgb_ch[channel].freq_red[0];
							dmy = 0;
							for(i = 0;i < (sizeof(rgb_ch[channel].freq_red) / sizeof(rgb_ch[channel].freq_red[0]));i++) {
								dmy += rgb_ch[channel].freq_red[i];
							}
							rgb_ch[channel].freq_red_ave = dmy / (sizeof(rgb_ch[channel].freq_red) / sizeof(rgb_ch[channel].freq_red[0]));
						}
						#endif
					}
					//blue
					else if(BLUE_CHK){
						//Blue_ct = tmp;
						//freq_B = clockCouter / tmp;
						rgb_ch[channel].freq_blue_ct = tmp;

						#if 0
						dmy = clockCouter / tmp;
						rgb_ch[channel].freq_blue[rgb_ch[channel].blue_pos] = dmy;
						rgb_ch[channel].blue_pos = (rgb_ch[channel].blue_pos + 1) % (sizeof(rgb_ch[channel].freq_blue) / sizeof(rgb_ch[channel].freq_blue)[0]);
						if(rgb_ch[channel].blue_pos == 0){
							rgb_ch[channel].blue_flg = 1;
						}
						rgb_ch[channel].freq_blue_ave = dmy;//rgb_ch[channel].freq_blue[0];
						#endif // 0


						#if 0
						if(rgb_ch[channel].blue_flg){
							pos = &rgb_ch[channel].freq_blue[0];
							dmy = 0;
							for(i = 0;i < (sizeof(rgb_ch[channel].freq_blue) / sizeof(rgb_ch[channel].freq_blue[0]));i++)
							{
								dmy += rgb_ch[channel].freq_blue[i];
							}
							rgb_ch[channel].freq_blue_ave = dmy / (sizeof(rgb_ch[channel].freq_blue) / sizeof(rgb_ch[channel].freq_blue[0]));
						}
						#endif
					}
					//no filter
					else if(NOFITER_CHK){
						//nofiter_ct = tmp;
						//freq_nofiter = clockCouter / tmp;
						rgb_ch[channel].freq_nofiter_ct = tmp;

						#if 0
						dmy = clockCouter / tmp;
						rgb_ch[channel].freq_nofiter[rgb_ch[channel].nofiter_pos] = dmy;//clockCouter / tmp;
						rgb_ch[channel].nofiter_pos = (rgb_ch[channel].nofiter_pos + 1) % (sizeof(rgb_ch[channel].freq_nofiter) / sizeof(rgb_ch[channel].freq_nofiter)[0]);
						if(rgb_ch[channel].nofiter_pos == 0){
							rgb_ch[channel].nofiter_flg = 1;
						}
						//rgb_ch[channel].freq_nofiter_ave = rgb_ch[channel].freq_nofiter[0];
						rgb_ch[channel].freq_nofiter_ave = dmy;
						#endif // 0

