TranNguyenDung/STM32_Xe/Program/program_00_02.c
						#if 0
						dmy = clockCouter / tmp;
						rgb_ch[channel].freq_red[rgb_ch[channel].red_pos] = dmy;//clockCouter / tmp;
						rgb_ch[channel].red_pos = (rgb_ch[channel].red_pos + 1) % (sizeof(rgb_ch[channel].freq_red) / sizeof(rgb_ch[channel].freq_red)[0]);
						if(rgb_ch[channel].red_pos == 0){
							rgb_ch[channel].red_flg = 1;
						}
						//rgb_ch[channel].freq_red_ave = rgb_ch[channel].freq_red[0];
						rgb_ch[channel].freq_red_ave = dmy;
						#endif // 0

						#if 0
						if(rgb_ch[channel].red_flg){
							pos = &rgb_ch[channel].freq_red[0];
							dmy = 0;
							for(i = 0;i < (sizeof(rgb_ch[channel].freq_red) / sizeof(rgb_ch[channel].freq_red[0]));i++){
								dmy += rgb_ch[channel].freq_red[i];
							}
							rgb_ch[channel].freq_red_ave = dmy / (sizeof(rgb_ch[channel].freq_red) / sizeof(rgb_ch[channel].freq_red[0]));
						}
						#endif
					}
					//blue
					else if(BLUE_CHK){
						//Blue_ct = tmp;
						//freq_B = clockCouter / tmp;
						rgb_ch[channel].freq_blue_ct = tmp;

						#if 0
						dmy = clockCouter / tmp;
						rgb_ch[channel].freq_blue[rgb_ch[channel].blue_pos] = dmy;//clockCouter / tmp;
						rgb_ch[channel].blue_pos = (rgb_ch[channel].blue_pos + 1) % (sizeof(rgb_ch[channel].freq_blue) / sizeof(rgb_ch[channel].freq_blue)[0]);
						if(rgb_ch[channel].blue_pos == 0){
							rgb_ch[channel].blue_flg = 1;
						}
						//rgb_ch[channel].freq_blue_ave = rgb_ch[channel].freq_blue[0];
						rgb_ch[channel].freq_blue_ave = dmy;
						#endif

						#if 0
						if(rgb_ch[channel].blue_flg){
							pos = &rgb_ch[channel].freq_blue[0];
							dmy = 0;
							for(i = 0;i < (sizeof(rgb_ch[channel].freq_blue) / sizeof(rgb_ch[channel].freq_blue[0]));i++){
								dmy += rgb_ch[channel].freq_blue[i];
							}
							rgb_ch[channel].freq_blue_ave = dmy / (sizeof(rgb_ch[channel].freq_blue) / sizeof(rgb_ch[channel].freq_blue[0]));
						}
						#endif
					}
					//no filter
					else if(NOFITER_CHK){
						//nofiter_ct = tmp;
						//freq_nofiter = clockCouter / tmp;
						rgb_ch[channel].freq_nofiter_ct = tmp;
						#if 0
						dmy = clockCouter / tmp;
						rgb_ch[channel].freq_nofiter[rgb_ch[channel].nofiter_pos] = dmy;//clockCouter / tmp;
						rgb_ch[channel].nofiter_pos = (rgb_ch[channel].nofiter_pos + 1) % (sizeof(rgb_ch[channel].freq_nofiter) / sizeof(rgb_ch[channel].freq_nofiter)[0]);
						if(rgb_ch[channel].nofiter_pos == 0){
							rgb_ch[channel].nofiter_flg = 1;
						}
						//rgb_ch[channel].freq_nofiter_ave = rgb_ch[channel].freq_nofiter[0];
						rgb_ch[channel].freq_nofiter_ave = dmy;
						#endif // 0

						#if 0
						if(rgb_ch[channel].nofiter_flg){
							pos = &rgb_ch[channel].freq_nofiter[0];
							dmy = 0;
							for(i = 0;i < (sizeof(rgb_ch[channel].freq_nofiter) / sizeof(rgb_ch[channel].freq_nofiter[0]));i++){
								dmy += rgb_ch[channel].freq_nofiter[i];
							}
							rgb_ch[channel].freq_nofiter_ave = dmy / (sizeof(rgb_ch[channel].freq_nofiter) / sizeof(rgb_ch[channel].freq_nofiter[0]));
						}
						#endif
					}
					//green 
					else if(GREEN_CHK){
						//Green_ct = tmp;
						//freq_G = clockCouter / tmp;
						rgb_ch[channel].freq_green_ct = tmp;
						#if 0
						dmy = clockCouter / tmp;
						rgb_ch[channel].freq_green[rgb_ch[channel].green_pos] = dmy;//clockCouter / tmp;
						rgb_ch[channel].green_pos = (rgb_ch[channel].green_pos + 1) % (sizeof(rgb_ch[channel].freq_green) / sizeof(rgb_ch[channel].freq_green)[0]);
						if(rgb_ch[channel].green_pos == 0){
							rgb_ch[channel].green_flg = 1;
						}
						//rgb_ch[channel].freq_green_ave = rgb_ch[channel].freq_green[0];
						rgb_ch[channel].freq_green_ave = dmy;
						#endif // 0

						#if 0
						if(rgb_ch[channel].green_flg){
							pos = &rgb_ch[channel].freq_green[0];
							dmy = 0;
							for(i = 0;i < (sizeof(rgb_ch[channel].freq_green) / sizeof(rgb_ch[channel].freq_green[0]));i++){
								dmy += rgb_ch[channel].freq_green[i];
							}
							rgb_ch[channel].freq_green_ave = dmy / (sizeof(rgb_ch[channel].freq_green) / sizeof(rgb_ch[channel].freq_green[0]));
						}
						#endif
					}
				}


				rgb_ch[channel].ccr_bk = tmp1;
			}

			//-----------------------------
			//Set pin LEFT & RIGHT to MEGA
			//HAL_GPIO_TogglePin(LED_TEST1_GPIO_Port,LED_TEST1_Pin);
			//HAL_GPIO_TogglePin(LED_TEST2_GPIO_Port,LED_TEST2_Pin);

		}
	}
	else if(htim->Instance == TIM5){
		if(s0_flg || s1_flg){
			if(htim->Channel == HAL_TIM_ACTIVE_CHANNEL_1){
				flg2 = 1;
				channel = RGB_CH5;
				tmp1 = __HAL_TIM_GetCompare(&htim5,TIM_CHANNEL_1);
				//tmp1 = __HAL_TIM_GetCounter(&htim5);
				#if 1
				if(tmp1 >= rgb_ch[channel].ccr_bk){
					tmp = tmp1 - rgb_ch[channel].ccr_bk;
				}
				else{
					//TIMER 32BIT
					tmp = 0XFFFFFFFF - rgb_ch[channel].ccr_bk + tmp1 + 1;
				}
				#endif
				#if 0
				__HAL_TIM_SetCompare(&htim5,TIM_CHANNEL_1,0);
				tmp = tmp1;
				#endif // 1

				if(rgb_ch[channel].set_filter_change_delay){
					rgb_ch[channel].set_filter_change_delay--;
					//rgb_ch[channel].set_filter_change_delay = 0;
				}
				else{
					//red
					if(RED_CHK){
						//Red_ct = tmp;
						//freq_R = clockCouter / tmp;
						rgb_ch[channel].freq_red_ct = tmp;

						#if 0
						dmy = clockCouter / tmp;
						rgb_ch[channel].freq_red[rgb_ch[channel].red_pos] = dmy;
						rgb_ch[channel].red_pos = (rgb_ch[channel].red_pos + 1) % (sizeof(rgb_ch[channel].freq_red)/ sizeof(rgb_ch[channel].freq_red)[0]);
						if(rgb_ch[channel].red_pos == 0){
							rgb_ch[channel].red_flg = 1;
						}
						rgb_ch[channel].freq_red_ave = dmy;//rgb_ch[channel].freq_red[0];
						#endif

						#if 0
						if(rgb_ch[channel].red_flg){
							pos = &rgb_ch[channel].freq_red[0];
							dmy = 0;
							for(i = 0;i < (sizeof(rgb_ch[channel].freq_red) / sizeof(rgb_ch[channel].freq_red[0]));i++) {
								dmy += rgb_ch[channel].freq_red[i];
							}
							rgb_ch[channel].freq_red_ave = dmy / (sizeof(rgb_ch[channel].freq_red) / sizeof(rgb_ch[channel].freq_red[0]));
						}
						#endif
					}
					//blue
					else if(BLUE_CHK){
						//Blue_ct = tmp;
						//freq_B = clockCouter / tmp;
						rgb_ch[channel].freq_blue_ct = tmp;

