TranNguyenDung/STM32_Xe/Program/program_00_02.c
						#if 0
						dmy = clockCouter / tmp;
						rgb_ch[channel].freq_blue[rgb_ch[channel].blue_pos] = dmy;
						rgb_ch[channel].blue_pos = (rgb_ch[channel].blue_pos + 1) % (sizeof(rgb_ch[channel].freq_blue) / sizeof(rgb_ch[channel].freq_blue)[0]);
						if(rgb_ch[channel].blue_pos == 0){
							rgb_ch[channel].blue_flg = 1;
						}
						rgb_ch[channel].freq_blue_ave = dmy;//rgb_ch[channel].freq_blue[0];
						#endif // 0


						#if 0
						if(rgb_ch[channel].blue_flg){
							pos = &rgb_ch[channel].freq_blue[0];
							dmy = 0;
							for(i = 0;i < (sizeof(rgb_ch[channel].freq_blue) / sizeof(rgb_ch[channel].freq_blue[0]));i++)
							{
								dmy += rgb_ch[channel].freq_blue[i];
							}
							rgb_ch[channel].freq_blue_ave = dmy / (sizeof(rgb_ch[channel].freq_blue) / sizeof(rgb_ch[channel].freq_blue[0]));
						}
						#endif
					}
					//no filter
					else if(NOFITER_CHK){
						//nofiter_ct = tmp;
						//freq_nofiter = clockCouter / tmp;
						rgb_ch[channel].freq_nofiter_ct = tmp;

						#if 0
						dmy = clockCouter / tmp;
						rgb_ch[channel].freq_nofiter[rgb_ch[channel].nofiter_pos] = dmy;//clockCouter / tmp;
						rgb_ch[channel].nofiter_pos = (rgb_ch[channel].nofiter_pos + 1) % (sizeof(rgb_ch[channel].freq_nofiter) / sizeof(rgb_ch[channel].freq_nofiter)[0]);
						if(rgb_ch[channel].nofiter_pos == 0){
							rgb_ch[channel].nofiter_flg = 1;
						}
						//rgb_ch[channel].freq_nofiter_ave = rgb_ch[channel].freq_nofiter[0];
						rgb_ch[channel].freq_nofiter_ave = dmy;
						#endif // 0

						#if 0
						if(rgb_ch[channel].nofiter_flg){
							pos = &rgb_ch[channel].freq_nofiter[0];
							dmy = 0;
							for(i = 0;i < (sizeof(rgb_ch[channel].freq_nofiter) / sizeof(rgb_ch[channel].freq_nofiter[0]));i++)
							{
								dmy += rgb_ch[channel].freq_nofiter[i];
							}
							rgb_ch[channel].freq_nofiter_ave = dmy / (sizeof(rgb_ch[channel].freq_nofiter) / sizeof(rgb_ch[channel].freq_nofiter[0]));
						}
						#endif
					}
					//green 
					else if(GREEN_CHK){
						//Green_ct = tmp;
						//freq_G = clockCouter / tmp;
						rgb_ch[channel].freq_green_ct = tmp;

						#if 0
						dmy = clockCouter / tmp;
						rgb_ch[channel].freq_green[rgb_ch[channel].green_pos] = dmy;
						rgb_ch[channel].green_pos = (rgb_ch[channel].green_pos + 1) % (sizeof(rgb_ch[channel].freq_green) / sizeof(rgb_ch[channel].freq_green)[0]);
						if(rgb_ch[channel].green_pos == 0){
							rgb_ch[channel].green_flg = 1;
						}
						//rgb_ch[channel].freq_green_ave = rgb_ch[channel].freq_green[0];
						rgb_ch[channel].freq_green_ave = dmy;
						#endif // 0

						#if 0
						if(rgb_ch[channel].green_flg){
							pos = &rgb_ch[channel].freq_green[0];
							dmy = 0;
							for(i = 0;i < (sizeof(rgb_ch[channel].freq_green) / sizeof(rgb_ch[channel].freq_green[0]));i++)
							{
								dmy += rgb_ch[channel].freq_green[i];
							}
							rgb_ch[channel].freq_green_ave = dmy / (sizeof(rgb_ch[channel].freq_green) / sizeof(rgb_ch[channel].freq_green[0]));
						}
						#endif
					}				
				}


				rgb_ch[channel].ccr_bk = tmp1;
			}
		}
	}

	if(flg2){
		rgb_pwm_flg = 1;
		rgb_pwm_tot = 10;
	}

	//------------------------------------------------------------
}
/*----------------------------------------------------------------*/







/*----------------------------------------------------------------*/

/// so sánh string
unsigned char string_compera(unsigned char* s_pos,char* d_pos)
{
	unsigned char i;
	unsigned char flg;
	i = 0;
	flg = 1;
	while(*(d_pos + i) != '#'){
		if(*(s_pos + i) != *(d_pos + i)){
			flg = 0;
			break;
		}
		i++;
	}
	return flg;
}

//1 byte type Bin to 2 byte type ascii
void bin2ascii(unsigned char* s_pos,unsigned char* d_pos,unsigned short len_s_pos)
{
	unsigned char data;
	unsigned char dmy;
	unsigned short i;
	unsigned short j;

	for(i = 0,j = 0;i < len_s_pos;i++,j += 2){
		data = *(s_pos + i);
		dmy = (data & 0xF0) >> 4;
		if(dmy < 10){
			*(d_pos + j) = dmy + '0';
		}
		else{
			*(d_pos + j) = dmy + 'A' - 10;
		}

		dmy = (data & 0x0F);
		if(dmy < 10){
			*(d_pos + j + 1) = dmy + '0';
		}
		else{
			*(d_pos + j + 1) = dmy + 'A' - 10;
		}
	}
}

//2 byte ascii to 1byte bin
unsigned char ascii2bin(unsigned char* s_pos,unsigned char* d_pos,unsigned short len_d_pos)
{
	//len num byte want get
	unsigned char flg;
	unsigned char data;
	unsigned char dmy;
	unsigned short i;
	unsigned short j;
	flg = 1;
	for(i = 0,j = 0;i < len_d_pos;i++,j += 2){
		dmy = 0;
		data = *(s_pos + j);
		if(data > '/' && data < ':'){//0 <-> 9
			dmy |= ((data - '0') << 4);
		}
		else if(data > '@' && data < 'G'){//A <-> F
			dmy |= ((data - 'A' + 10) << 4);
		}
		else{
			flg = 0;
			break;
		}

		data = *(s_pos + j + 1);
		if(data > '/' && data < ':'){//0 <-> 9
			dmy |= data - '0';
		}
		else if(data > '@' && data < 'G'){//A <-> F
			dmy |= data - 'A' + 10;
		}
		else{
			flg = 0;
			break;
		}
		*(d_pos + i) = dmy;
	}

	return flg;
}

//utf8_to_ascii()
//Input: Data type UFT-8
//Output: ascci không dấu 
/*-------------------------------------------*/
unsigned char utf8_to_ascii(unsigned char *s_pos,unsigned short s_pos_len,unsigned char *d_pos,unsigned short *d_pos_len)
{
	unsigned short i;
	unsigned short j;
	unsigned long tmp;
	unsigned short data;
	unsigned char flg;
	unsigned char chr;
	unsigned short d_pos_ct;
	flg = 1;
	d_pos_ct = 0;
	for(i = 0;i < s_pos_len;i++){//Format 0b1110xxxx-10xxxxxx-10xxxxxx
		if((*(s_pos + i + 0) & 0xF0) == 0xE0){//type utf-8 type 3byte
			if(*(s_pos + i + 1) & 0x80){//type utf-8
				if(*(s_pos + i + 2) & 0x80){//type utf-8
					tmp = *(s_pos + i + 0);
					tmp <<= 8;
					tmp |= *(s_pos + i + 1);
					tmp <<= 8;
					tmp |= *(s_pos + i + 2);
					//s1_send_long(&tmp);
					data = (unsigned short) ((tmp & 0x0F0000) >> 4);
					data |= (unsigned short) ((tmp & 0x3C00) >> 2);
					data |= (unsigned short) ((tmp & 0x0300) >> 2);
					data |= (unsigned short) (tmp & 0x3F);
					if((data >= 0x1EA0) && (data <= 0X1EF9)){
						//s1_send_work(&data);
						i += 2;
						j = 0;
						while(utf8_vi_3byte_tab[j] != 0xFFFF){
							if(utf8_vi_3byte_tab[j] == data){
								chr = utf8_vi_3byte_tab[j + 1];
								//s1_send_buff(&chr,1);
								*(d_pos + d_pos_ct++) = chr;
								break;
							}
							j += 2;
						}
					}
					else{
						flg = 0;
					}
				}
				else{//Error
					flg = 0;
				}
			}
			else{//Error
				flg = 0;
			}
		}
		else if((*(s_pos + i + 0) & 0xE0) == 0xC0){//type utf-8 type 2byte
			if(*(s_pos + i + 1) & 0x80){//type utf-8
			  //Format 0b110xxxxx-10xxxxxx
				tmp = *(s_pos + i + 0);
				tmp <<= 8;
				tmp |= *(s_pos + i + 1);
				data = (unsigned short) ((tmp & 0x1F00) >> 2);
				data |= (unsigned short) ((tmp & 0x3F));
				if((data >= 0x00C0) && (data <= 0x01B0)){
					//s1_send_work(&data);
					i += 1;
					j = 0;
					while(utf8_vi_2byte_tab[j] != 0xFFFF){
						if(utf8_vi_2byte_tab[j] == data){
							chr = utf8_vi_2byte_tab[j + 1];
							//s1_send_buff(&chr,1);
							*(d_pos + d_pos_ct++) = chr;
							break;
						}
						j += 2;
					}
				}
			}
			else{
				flg = 0;
			}
		}
		else{
			*(d_pos + d_pos_ct++) = *(s_pos + i);
		}
	}
	*d_pos_len = d_pos_ct;
	//s1_send_buff(d_pos, d_pos_ct);
	return flg;

