TranNguyenDung/STM32_Xe/Program/program_00_02.c
}

#if 0
//Support type ascii
void Upper(unsigned char *s_pos,unsigned short s_pos_len)
{
	unsigned short i;
	//unsigned char tmp;

	for(i = 0;i < s_pos_len;i++){
		*(s_pos + i) = toupper(*(s_pos + i));
	}
}
#endif // 0

//Support type ascii
void Upper(unsigned char *string,unsigned short s_pos_len)
{
	const char OFFSET = 'a' - 'A';
	unsigned short i;

	for(i = 0;i < s_pos_len;i++){
		*(string + i) = (*(string + i) >= 'a' && *(string + i) <= 'z') ? *(string + i) -= OFFSET : *(string + i);
	}
}

//Compare string dynamic
//ex: str_compare(pos,"SRTING COMPARE")
//Input: pos: địa chỉ chuổi muốn kiểm tra ex: pos = &bluetooth_buff[0];
//Output: 1 nếu có chuổi ký tự trong pos/ 0: nếu không có string trong pos
unsigned char str_compare(unsigned char *str1,const char *str2,unsigned short len)
{
    unsigned char flg;
    unsigned short lenstr1;
    unsigned short lenstr2;
    unsigned short i,j;
    unsigned char same_flg;
    //unsigned char *pos;
    //unsigned long tmp;
    //unsigned char buff[128];

    //Serial.println("--------------------------");
    //Serial.println(sizeof(flg));
    //Serial.println(sizeof(tmp));
    //Serial.println("--------------------------");
    lenstr2 = strlen(str2);

    //lenstr1 = strlenghtV2(str1);

    //lenstr2 = strlenght(str2);


    lenstr1 = len;
    flg = 0;
    //Serial.print("lenstr1: ");
    //Serial.println(lenstr1);
    //Serial.print("lenstr2: ");
    //Serial.println(lenstr2); 

    if(lenstr1 < lenstr2){
        //Serial.println("ERROR");
        goto END_COMPARE;
    }

    //s0_send_buff(str1,lenstr1);
    //s1_send_buff(str2,lenstr2);


    for(i = 0;i < lenstr1 - lenstr2 + 1;i++){
        same_flg = 1;
        for(j = 0;j < lenstr2;j++){
            //Serial.println(*(str1 + i + j));
            //Serial.println(*(str2 + j));
            if((*(str1 + i + j)) ^ *(str2 + j)){
                same_flg = 0;
                break;
            }
        }
        if(same_flg){
            break;
        }
    }

    if(same_flg){
        flg = 1;
    }
    else{
        flg = 0;
    }

END_COMPARE:
    return flg;
}

/*----------------------------------------------------------------*/
